const baseWord = {
  "فع": ['فع'],
  "فعل": ['ف', 'عل'],
  "فع‌لن": ['فع', 'لن'],
  "فعلن": ['ف', 'ع', 'لن'],
  "مفعول": ['مف', 'عو', 'ل'],
  "فعولن": ['ف', 'عو', 'لن'],
  "فاعلن": ['فا', 'ع', 'لن'],
  "فعلان": ['فع', 'لان'],
  "مفعولن": ['مف', 'عو', 'لن'],
  "مفاعل": ['م', 'فا', 'ع', 'ل'],
  "مفاعیل": ['م', 'فا', 'عی', 'ل'],
  "مستفعل": ['مس', 'تف', 'ع', 'ل'],
  "فعلات": ['ف', 'ع', 'لا', 'ت'],
  "فاعلات": ['فا', 'ع', 'لا', 'ت'],
  "فعلاتن": ['ف', 'ع', 'لا', 'تن'],
  "مفاعلن": ['م', 'فا', 'ع', 'لن'],
  "مفتعلن": ['مف', 'ت', 'ع', 'لن'],
  "مفاعیلن": ['م', 'فا', 'عی', 'لن'],
  "فاعلاتن": ['فا', 'ع', 'لا', 'تن'],
  "مستفعلن": ['مس', 'تف', 'ع', 'لن']
}

let acceptWordList = {

}
let wordList = {
  ...acceptWordList, 
  "به": ['ب'],
  "تو": ['ت'],
  "چه": ["چ"],
  "سه": ['س'],
  "که": ['ک'],
  "یه": ['ی'],
  "نه": ['ن'],
  "چو": ['چ'],
  "نو": ['ن'],
  "یو": ['ی'],
  
  "کو": ['کو'],
  "جو": ['جو'],
  "شو": ['شو'],
  "دو": ['دو'],
  "بَه": ['به'],
  "چَه": ['چه'],
  "ره": ['ره'],
  "ته": ['ته'],
  "شب": ['شب'],

  "پر": ['پر'],
  "پَر": ['پر'],
  "پُر": ['پر'],
  "فر": ['فر'],
  "فِر": ['فر'],
  "سر": ['سر'],
  "سُر": ['سر'],

  "همه": ['ه', 'م'],
  "کمه": ['ک', 'م'],
  "شبه": ['ش', 'ب'],
  "رمه": ['ر', 'م'],
  "دمه": ['د', 'م'],
  "بمه": ['ب', 'م'],
  "زنه": ['ز', 'ن'],
  "چمه": ['چ', 'م'],

  "بپا": ['ب', 'پا'],
  "بزن": ['ب', 'زن'],
  "بدن": ['ب', 'دن'],
  "تنم": ['ت', 'نم'],
  "تنت": ['ت', 'نت'],
  "تنش": ['ت', 'نش'],
  "تبر": ['ت', 'بر'],
  "زبر": ['ز', 'بر'],
  "مبر": ['م', 'بر'],
  "نبر": ['ن', 'بر'],
  "اگر": ['ا', 'گر'],
  "ثمر": ['ث', 'مر'],
  "حذر": ['ح', 'ذر'],
  "خزر": ['خ', 'زر'],
  "سحر": ['س', 'حر'],
  "سَحر": ['س', 'حر'],
  "سِحر": ['سح', 'ر'],
  "خطر": ['خ', 'طر'],
  "کمر": ['ک', 'مر'],
  "خبر": ['خ', 'بر'],
  "خبرم": ['خ', 'ب', 'رم'],
  "خبرش": ['خ', 'ب', 'رش'],
  "خبرت": ['خ', 'ب', 'رت'],
  "خبرمان": ['خ', 'ب', 'ر', 'ما'],
  "خبرشان": ['خ', 'ب', 'ر', 'شا'],
  "خبرتان": ['خ', 'ب', 'ر', 'تا'],

  "کمرم": ['ک', 'م', 'رم'],
  "کمرت": ['ک', 'م', 'رت'],
  "کمرش": ['ک', 'م', 'رش'],
  "کمرمان": ['ک', 'م', 'ر', 'ما'],
  "کمرتان": ['ک', 'م', 'ر', 'تا'],
  "کمرشان": ['ک', 'م', 'ر', 'شا'],
  "کمان": ['ک', 'ما', 'ن'],
  "کمانم": ['ک', 'ما', 'نم'],
  "کمانت": ['ک', 'ما', 'نت'],
  "کمانش": ['ک', 'ما', 'نش'],
  "جهان": ['ج', 'ها', 'ن'],
  "زمان": ['ز', 'ما', 'ن'],
  "زمانه": ['ز', 'ما', 'ن'],
  "مستانه": ['مس', 'تا', 'ن'],
  "رسان": ['ر', 'سا', 'ن'],
  "توان": ['ت', 'وا', 'ن'],
  "نرساندی": ['ن', 'ر', 'سا', 'ن', 'دی'],
  "برساندی": ['ب', 'ر', 'سا', 'ن', 'دی'],
  "بنشاندی": ['ب', 'ن', 'شا', 'ن', 'دی'],
  "ننشاندی": ['ن', 'ن', 'شا', 'ن', 'دی'],
  "سرم": ['س', 'رم'],
  "سرت": ['س', 'رت'],
  "سرش": ['س', 'رش'],
  "دهم": ['د', 'هم'],
  "دهی": ['د', 'هی'],
  "دهد": ['د', 'هد'],
  "زره": ['ز', 'ره'],
  "قمر": ['ق', 'مر'],
  "جنم": ['ج', 'نم'],
  "عجب": ['ع', 'جب'],
  "هوس": ['ه', 'وس'],
  "کنم": ['ک', 'نم'],
  "کنی": ['ک', 'نی'],
  "کند": ['ک', 'ند'],
  "کنیم": ['ک', 'نی', 'م'],
  "کنید": ['ک', 'نی', 'د'],
  "کنند": ['ک', 'نن', 'د'],
  "میکنند": ['می', 'ک', 'نن', 'د'],
  "میکنیم": ['می', 'ک', 'نی', 'م'],
  "میکنن": ['می', 'ک', 'نن'],
  

  "منم": ['م', 'نم'],
  "وطن": ['و', 'طن'],
  "زنم": ['ز', 'نم'],
  "زنت": ['ز', 'نت'],
  "زنش": ['ز', 'نش'],
  "صنم": ['ص', 'نم'],
  "شَوی": ['ش', 'وی'],
  "دیده": ['دی', 'د'],


  "دود": ['دو', 'د'],
  "کود": ['کو', 'د'],
  "جود": ['جو', 'د'],
  "سود": ['سو', 'د'],
  "بود": ['بو', 'د'],
  "زود": ['زو', 'د'],
  "عود": ['عو', 'د'],
  "مود": ['مو', 'د'],
  "هود": ['هو', 'د'],
  "پود": ['پو', 'د'],
  "رود": ['رو', 'د'],
  "چود": ['چو', 'د'],
  "نود": ['نو', 'د'],
  "فود": ['فو', 'د'],
  "قود": ['قو', 'د'],
  "تود": ['تو', 'د'],
  "خود": ['خو', 'د'],
  "شود": ['شو', 'د'],
  "لود": ['لو', 'د'],
  "گود": ['گو', 'د'],



  "بند": ['بن', 'د'],
  "قند": ['قن', 'د'],
  "شوی": ['شو', 'ی'],

  "ارزش": ['ار', 'زش'],
  "ارزد": ['ار', 'زد'],


  "انبار": ['ان', 'با', 'ر'],
  "ادبان": ['ا', 'د', 'با'],
  "آرش": ["ءا", 'رش'],

  "آب": ["ءا", 'ب'],
  "اب": ["ءا", 'ب'],
  "آن": ["ءا", 'ن'],
  "این":['ای', 'ن'],
  

  "آغوشمان": ["ءا", 'غو', 'ش', 'ما'],
  "آغوشتان": ["ءا", 'غو', 'ش', 'تا'],
  "آغوششان": ["ءا", 'غو', 'ش', 'شا'],
  "آلمانی": ["ءا", 'ل', 'ما', 'نی'],
  "آرزو": ['ءا', 'ر', 'زو'],
  

  "برا": ['ب', 'را'],
  "برای": ['ب', 'را', 'ی'],
  "بچه": ['بچ', 'چ'],
  "نقطه":['نق', 'ط'],

  "بلبل": ['بل', 'بل'],
  "بیابان": ['ب', 'یا', 'با'],
  "درختان": ['د', 'رخ', 'تا'],
  "بسوز":['ب', 'سو', 'ز'],
  "بمیرم": ['ب', 'می', 'رم'],
  "باشم": ['با', 'شم'],
  "باشی": ['با', 'شی'],
  "باشد": ['با', 'شد'],
  "رازم": ['را', 'زم'],
  "رازی": ['را', 'زی'],
  "رازش": ['را', 'زش'],
  "جانم": ['جا', 'نم'],
  "جانش": ['جا', 'نش'],
  "جانت": ['جا', 'نت'],
  "جانی": ['جا', 'نی'],
  "جانانه": ['جا', 'نا', 'ن'],


  "زنان":['ز', 'نا'],
  "چنان":['چ', 'نا'],
  "کنان":['ک', 'نا'],
  "سران":['س', 'را'],

  "سیاهی": ['سی', 'یا', 'هی'],
  "تباهی": ['ت', 'با', 'هی'],
  "گاهی": ['گا', 'هی'],
  "کاهی": ['کا', 'هی'],
  "خواهی": ['خا', 'هی'],
  "راهی": ['را', 'هی'],
  "ماهی": ['ما', 'هی'],
  "آهی": ['ءا', 'هی'],
  
  "چرا": ['چ', 'را'],

  "مبادا":['م', 'با', 'دا'],
  "بیا":['بی', 'یا'],
  "نیاز":['ن', 'یا', 'ز'],
  "نمک":['ن', 'مک'],
  "نفس": ['ن', 'فس'],
  "حرامان":['ح', 'را', 'ما'],
  "چو": ['چ'],
  "رفاقت":['ر', 'فا', 'قت'],
  "بساز":['ب', 'سا', 'ز'],
  "مسیر":['م', 'سی', 'ر'],
  "توام":['تو', 'ام'],
  "کنون":['ک', 'نو', 'ن'],
  "نفرین":['نف', 'ری', 'ن'],
  "گویمت":['گو', 'ی', 'مت'],
  "دعای":['د', 'عا', 'ی'],
  "دیازپام":['دی', 'یا', 'ز', 'پا', 'م'],
  "نماز":['ن', 'ما', 'ز'],
  "همچو": ['هم', 'چ'],
  "گریبان":['گ', 'ری', 'با'],
  "صبر": ['صب', 'ر'],
  "فکر": ['فک', 'ر'],
  "اما": ['ام', 'ما'],
  "شما": ['ش', 'ما'],
  "کما": ['ک', 'ما'],
  "هما": ['ه', 'ما'],
  "اسیر": ['ا', 'سی', 'ر'],
  "آخرش": ['ءا', 'خ', 'رش'],
  "آدمی": ['ءا', 'د', 'می'],
  "آدمم": ['ءا', 'د', 'مم'],
  "آرشم": ["ءا", 'ر', 'شم'],
  "آرشت": ["ءا", 'ر', 'شت'],
  "آرشش": ["ءا", 'ر', 'شش'],
  "آرشمان": ["ءا", 'رش', 'ما'],
  "آرشتان": ["ءا", 'رش', 'تا'],
  "آرششان": ["ءا", 'رش', 'شا'],


  "دیوانه": ['دی', 'وا', 'ن'],
  "هندوانه": ['هن', 'د', 'وا', 'ن'],
  "دراز": ['د', 'را', 'ز'],

  "آغوش": ["ءا", 'غو', 'ش'],
  "آغوشم": ["ءا", 'غو', 'شم'],
  "آغوشت": ["ءا", 'غو', 'شت'],
  "آغوشش": ["ءا", 'غو', 'شش'],
  
  "بگیرم": ['ب', 'گی', 'رم'],
  "بگیری": ['ب', 'گی', 'ری'],
  "بگیرد": ['ب', 'گی', 'رد'],
  "بگیریم": ['ب', 'گی', 'ری', 'م'],
  "بگیرید": ['ب', 'گی', 'ری', 'د'],
  "بگیرند": ['ب', 'گی', 'رن', 'د'],
  "برایم": ['ب', 'را', 'یم'],
  "برایت": ['ب', 'را', 'یت'],
  "برایش": ['ب', 'را', 'یش'],
  "برایمان": ['ب', 'را', 'ی', 'ما'],
  "برایتان": ['ب', 'را', 'ی', 'تا'],
  "برایشان": ['ب', 'را', 'ی', 'شا'],
  "برام": ['ب', 'را', 'م'],
  "برات": ['ب', 'را', 'ت'],
  "براش": ['ب', 'را', 'ش'],
  "برامون": ['ب', 'را', 'مو', 'ن'],
  "براتون": ['ب', 'را', 'تو', 'ن'],
  "براشون": ['ب', 'را', 'شو', 'ن'],
  "بسیار": ['بس', 'یا', 'ر'],
  "باهام": ['با', 'ها', 'م'],
  "باهات": ['با', 'ها', 'ت'],
  "باهاش": ['با', 'ها', 'ش'],

  "بدانم": ['ب', 'دا', 'نم'],
  "بدانی": ['ب', 'دا', 'نی'],
  "بداند": ['ب', 'دا', 'ند'],
  "بدانیم": ['ب', 'دا', 'نی', 'م'],
  "بدانید": ['ب', 'دا', 'نی', 'د'],
  "بدانند": ['ب', 'دا', 'نن', 'د'],

  "بدون": ['ب', 'دو', 'ن'],
  "بفروشم": ['بف', 'رو', 'ش', 'م'],
  "بفروشی": ['بف', 'رو', 'شی'],
  "بفروشد": ['بف', 'رو', 'شد'],
  "بفروشیم": ['بف', 'رو', 'شی', 'م'],
  "بفروشید": ['بف', 'رو', 'شی', 'د'],
  "بفروشند": ['بف', 'رو', 'شن', 'د'],

  "برهانم": ['ب', 'ر', 'ها', 'نم'],
  "برهانی": ['ب', 'ر', 'ها', 'نی'],
  "برهاند": ['ب', 'ر', 'ها', 'ند'],
  "برهانیم": ['ب', 'ر', 'ها', 'نی', 'م'],
  "برهانید": ['ب', 'ر', 'ها', 'نی', 'د'],
  "برهانند": ['ب', 'ر', 'ها', 'نن', 'د'],
  "بگرد": ['ب', 'گر', 'د'],
  "بگردم": ['ب', 'گر', 'دم'],
  "بگردی": ['ب', 'گر', 'دی'],
  "بگردد": ['ب', 'گر', 'دد'],
  "بگردیم": ['ب', 'گر', 'دی', 'م'],
  "بگردید": ['ب', 'گر', 'دی', 'د'],
  "بگردند": ['ب', 'گر', 'دن', 'د'],

  "برترین": ['بر', 'تر', 'ری', 'ن'],
  "برترم": ['بر', 'تر', 'م'],
  "برتری": ['بر', 'تر', 'ی'],
  "برتریم": ['بر', 'تر', 'ری', 'م'],
  "برترید": ['بر', 'تر', 'ری', 'د'],
  "برترند": ['بر', 'تر', 'رن', 'د'],


  "افتاده": ['اف', 'تا', 'د'],
  "فهمیده": ['فه', 'می', 'د'],
  "ترسیده": ['تر', 'سی', 'د'],
  "جهیده": ['ج', 'هی', 'د'],
  "خمیده": ['خ', 'می', 'د'],
  "رمیده": ['ر', 'می', 'د'],
  "لمیده": ['ل', 'می', 'د'],
  "دمیده": ['د', 'می', 'د'],

  "گویید":  ['گو', 'یی', 'د'],
  "هستید":  ['هس', 'تی', 'د'],
  "بینید":  ['بی', 'نی', 'د'],
  "سیرید":  ['سی', 'ری', 'د'],
  "رفتید":  ['رف', 'تی', 'د'],
  "دیدید":  ['دی', 'دی', 'د'],
  "فهمید":  ['فه', 'می', 'د'],
  "آیید":   ['ءا', 'یی', 'د'],
  "ناهید":  ['نا', 'هی', 'د'],
  "نارید":  ['نا', 'ری', 'د'],
  "جاوید":  ['جا', 'وی', 'د'],
  "جارید":  ['جا', 'ری', 'د'],
  "کاهید":  ['کا', 'هی', 'د'],
  "سایید":  ['سا', 'یی', 'د'],
  "سابید":  ['سا', 'بی', 'د'],
  "قاپید":  ['قا', 'پی', 'د'],
  "بافید":  ['با', 'فی', 'د'],
  "بارید":  ['با', 'ری', 'د'],
  "لافید":   ['لا', 'فی', 'د'],
  "دافید":  ['دا', 'فی', 'د'],
  "داغید":  ['دا', 'غی', 'د'],
  "حالید":  ['حا', 'لی', 'د'],
  "زایید":  ['زا', 'یی', 'د'],
  "زارید":  ['زا', 'ری', 'د'],
  "کارید":  ['کا', 'ری', 'د'],
  "مالید":  ['ما', 'لی', 'د'],
  "سالید":  ['سا', 'لی', 'د'],
  "پایید":  ['پا', 'یی', 'د'],
  "پایین":  ['پا', 'یی', 'ن'],
  "پاشید":  ['پا', 'شی', 'د'],
  "کاوید":  ['کا', 'وی', 'د'],
  "خواهید": ['خا', 'هی', 'د'],
  "خوابید": ['خا', 'بی', 'د'],
  "خامید": ['خا', 'می', 'د'],
  "خاصید":  ['خا', 'صی', 'د'],
  "هارید":  ['ها', 'ری', 'د'],
  "گاوید":  ['گا', 'وی', 'د'],
  "مارید":  ['ما', 'ری', 'د'],

  "پروانه": ['پر', 'وا', 'ن'],
  "پرنده": ['پ', 'رن', 'د'],
  "رسیده": ['ر', 'سی', 'د'],
  "ندیده": ['ن', 'دی', 'د'],
  "تلخ": ['تل', 'خ'],
  "تجربه": ['تج', 'ر', 'ب'],
  
  "ترسو": ['تر', 'سو'],
  "تعریف": ['تع', 'ری', 'ف'],
  "تعریفی": ['تع', 'ری', 'فی'],
  "تعریفم": ['تع', 'ری', 'فم'], 
  "تعریفت": ['تع', 'ری', 'فت'], 
  "تعریفش": ['تع', 'ری', 'فش'], 
  "تلاش": ['ت', 'لا', 'ش'],
  "تلاشش": ['ت', 'لا', 'شش'],
  "تلاشم": ['ت', 'لا', 'شم'],
  "تلاشت": ['ت', 'لا', 'شت'],

  "افسانه": ['اف', 'سا', 'ن'],
  "مردانه": ['مر', 'دا', 'ن'],
  "زنانه": ['ز', 'نا', 'ن'],
  "مهدی": ['مه', 'دی'],

  "خفتم": ['خف', 'تم'],
  "خفتی": ['خف', 'تی'],
  "خفت": ['خف', 'ت'],
  "خفته": ['خف', 'ت'],

  "جاهل": ['جا', 'هل'],
  "ژاپن": ['ژا', 'پن', 'ن'],
  "ژاپنی": ['ژا', 'پ', 'نی'],
  "روان": ['ر', 'وا', 'ن'],
  "روانم": ['ر', 'وا', 'نم'],
  "روانت": ['ر', 'وا', 'نت'],
  "روانش": ['ر', 'وا', 'نش'],
  "ربود": ['ر', 'بو', 'د'],
  "ربودم": ['ر', 'بو', 'دم'],
  "ربودی": ['ر', 'بو', 'دی'],
  "ربودش": ['ر', 'بو', 'دش'],

  "زنانه": ['ز', 'نا', 'ن'],
  "سرانه": ['س', 'را', 'ن'],
  "ادامه": ['ا', 'دا', 'م'],
  "کمانه": ['ک', 'ما', 'ن'],
  "سخت": ['سخ', 'ت'],
  "سردمه": ['سر', 'د', 'م'],
  "سردم": ['سر', 'دم'],
  "سردت": ['سر', 'دت'],
  "سردش": ['سر', 'دش'],
  "سردمان": ['سر', 'د', 'ما'],
  "سردتان": ['سر', 'د', 'تا'],
  "سردشان": ['سر', 'د', 'شا'],

  "کلامم": ['ک', 'لا', 'مم'],
  "کلامت": ['ک', 'لا', 'مت'],
  "کلامش": ['ک', 'لا', 'مش'],
  "کلام": ['ک', 'لا', 'م'],
  "تمام": ['ت', 'ما', 'م'],
  "تماشا": ['ت', 'ما', 'شا'],
  "تماشای": ['ت', 'ما', 'شا', 'ی'],
  "سلایق": ['س', 'لا', 'یق'],
  "علایق": ['ع', 'لا', 'یق'],
  "شقایق": ['ش', 'قا', 'یق'],
  "سلایقم": ['س', 'لا', 'ی', 'قم'],
  "علایقم": ['ع', 'لا', 'ی', 'قم'],
  "علایقمم": ['ع', 'لا', 'ی', 'ق', 'مم'],
  "غافلم": ['غا', 'ف', 'لم'],
  "عاقلم": ['عا', 'ق', 'لم'],
  "بالغم": ['با', 'ل', 'غم'],

  "بزار": ['ب', 'زا', 'ر'],
  "بزارم": ['ب', 'زا', 'رم'],
  "بزاری": ['ب', 'زا', 'ری'],
  "بزارد": ['ب', 'زا', 'رد'],
  "بزاریم": ['ب', 'زا', 'ری', 'م'],
  "بزارید": ['ب', 'زا', 'ری', 'د'],
  "بزارند": ['ب', 'زا', 'رن', 'د'],
  "بذار": ['ب', 'ذا', 'ر'],
  "بذارم": ['ب', 'ذا', 'رم'],
  "بذاری": ['ب', 'ذا', 'ری'],
  "بذارد": ['ب', 'ذا', 'رد'],
  "بذاریم": ['ب', 'ذا', 'ری', 'م'],
  "بذارید": ['ب', 'ذا', 'ری', 'د'],
  "بذارند": ['ب', 'ذا', 'رن', 'د'],
  "نزار": ['ن', 'زا', 'ر'],
  "نزارم": ['ن', 'زا', 'رم'],
  "نزاری": ['ن', 'زا', 'ری'],
  "نزارد": ['ن', 'زا', 'رد'],
  
  "نزا": ['ن', 'زا'],
  "لذا": ['ل', 'ذا'],
  "رضا": ['ر', 'ضا'],
  "عوض": ['ع', 'وض'],
  "منو": ['م', 'نو'],

  "خاطرات": ['خا', 'ط', 'را', 'ت'],
  "خاطراتت": ['خا', 'ط', 'را', 'تت'],
  
  "قایق": ['قا', 'یق'],
  "لایق": ['لا', 'یق'],
  "نمیشه": ['ن', 'می', 'ش'],
  "میمونه": ['می', 'مو', 'ن'],
  "منی": ['م', 'نی'],
  "همراه": ['هم', 'را', 'ه'],
  "همراهی": ['هم', 'را', 'هی'],
  "همون": ['ه', 'مو', 'ن'],
  "گلوله": ['گ', 'لو', 'ل'],
  "شکوفه": ['ش', 'کو', 'ف'],
  "دوچرخه": ['دو', 'چر', 'خ'],
  "درده": ['در', 'د'],
  "دلباخته": ['دل', 'با', 'خ', 'ت'],
  "دلواپس": ['دل', 'وا', 'پس'],
  "خوشمزه": ['خو', 'ش', 'مز', 'ز'],
  "جرعه": ['جر', 'ع'],
  "قافیه": ['قا', 'فی', 'ی'],
  "غریبه": ['غ', 'ری', 'ب'],

  "سردادم": ['سر', 'دا', 'دم'],
  "سردادی": ['سر', 'دا', 'دی'],
  "سرداد": ['سر', 'دا', 'د'],
  "سردادیم": ['سر', 'دا', 'دی', 'م'],
  "سردادید": ['سر', 'دا', 'دی', 'د'],
  "سردادند": ['سر', 'دا', 'دن', 'د'],

  "شبی": ['ش', 'بی'],
  "شراب": ['ش', 'را', 'ب'],
  "شرابم": ['ش', 'را', 'بم'],
  "شرابت": ['ش', 'را', 'بت'],
  "شرابش": ['ش', 'را', 'بش'],
  "شرابمان": ['ش', 'را', 'ب', 'ما'],
  "شرابتان": ['ش', 'را', 'ب', 'تا'],
  "شرابشان": ['ش', 'را', 'ب', 'شا'],

  
  "زندگی": ['زن', 'د', 'گی'],
  "زندگیم": ['زن', 'د', 'گی', 'یم'],
  "زندگیت": ['زن', 'د', 'گی', 'یت'],
  "زندگیش": ['زن', 'د', 'گی', 'یش'],
  
  "زدم": ['ز', 'دم'],
  "زدی": ['ز', 'دی'],
  "زده": ['ز', 'د'],
  "زدیم": ['ز', 'دی', 'م'],
  "زدید": ['ز', 'دی', 'د'],
  "زدند": ['ز', 'دن', 'د'],

  "زبان": ['ز', 'با', 'ن'],
  "زبانم": ['ز', 'با', 'نم'],
  "زبانت": ['ز', 'با', 'نت'],
  "زبانمان": ['ز', 'با', 'ن', 'ما'],
  "زمین": ['ز', 'می', 'ن'],
  "همین": ['ه', 'می', 'ن'],
  "همینم": ['ه', 'می', 'نم'],
  "رنگین": ['رن', 'گی', 'ین'],
  
  "ربودمان":['ر', 'بو', 'د', 'ما'],
  "روانمان": ['ر', 'وا', 'ن', 'ما'],
  "روانتان": ['ر', 'وا', 'ن', 'تا'],
  "روانشان": ['ر', 'وا', 'ن', 'شا'],

  "روزگار": ['رو', 'ز', 'گا', 'ر'],
  "روزگاری": ['رو', 'ز', 'گا', 'ری'],
  "روزگارم": ['رو', 'ز', 'گا', 'رم'],
  "روزگارت": ['رو', 'ز', 'گا', 'رت'],
  "روزگارش": ['رو', 'ز', 'گا', 'رش'],
  "روزگارمان": ['رو', 'ز', 'گا', 'ر', 'ما'],
  "روزگارتان": ['رو', 'ز', 'گا', 'ر', 'تا'],
  "روزگارشان": ['رو', 'ز', 'گا', 'ر', 'شا'],
  "راضی": ['را', 'ضی'],
  "خلق": ['خل', 'ق'],
  "خوشبختی": ['خو', 'ش', 'بخ', 'تی'],
  "دوستیابی": ['دو', 'س', 'یا', 'بی'],
  "دوست": ['دس', 'ت'],
  "دوستم": ['دس', 'تم'],
  "دوستت": ['دس', 'تت'],
  "دوستش": ['دس', 'تش'],
  "دوستی": ['دس', 'تی'],
  "معنی": ['مع', 'نی'],
  "درد": ['در', 'د'],
  "دردم": ['در', 'دم'],
  "دردت": ['در', 'دت'],
  "دردش": ['در', 'دش'],
  "دردمان": ['در', 'د', 'ما'],
  "دردتان": ['در', 'د', 'تا'],
  "دردشان": ['در', 'د', 'شا'],

  "دفع": ['د', 'فع'],
  "دفترم": ['دف', 'ت', 'رم'],
  "دفترت": ['دف', 'ت', 'رت'],
  "دفترش": ['دف', 'ت', 'رش'],
  "دفترمان": ['دف', 'ت', 'ر', 'ما'],
  "دفترتان": ['دف', 'ت', 'ر', 'تا'],
  "دفترشان": ['دف', 'ت', 'ر', 'شا'],
  "دیار": ['د', 'یا', 'ر'],
  "نگار": ['ن', 'گا', 'ر'],
  "معلم": ['م', 'عل', 'لم'],
  "دیارم": ['د', 'یا', 'رم'],
  "دیارت": ['د', 'یا', 'رت'],
  "دیارش": ['د', 'یا', 'رش'],
  "نگارم": ['ن', 'گا', 'رم'],
  "نگارت": ['ن', 'گا', 'رت'],
  "نگارش": ['ن', 'گا', 'رش'],
  "دریا": ['در', 'یا'],

  "دلان": ['د', 'لا'],
  "دری": ['د', 'ری'],
  "دلم": ["د", 'لم'],
  "دلت": ["د", 'لت'],
  "دلش": ["د", 'لش'],

  "نگاه": ['ن', 'گا', 'ه'],
  "نگاهم": ['ن', 'گا', 'هم'],
  "نگاهت": ['ن', 'گا', 'هت'],
  "نگاهش": ['ن', 'گا', 'هش'],

  "لطف": ['لط', 'ف'],

  "دیبا": ['دی', 'با'],
  "بیجا": ['بی', 'جا'],
  "صحرا": ['صح', 'را'],
  "دارا": ['دا', 'را'],
  "سارا": ['سا', 'را'],
  "کارا": ['کا', 'را'],
  "بارا": ['با', 'را'],
  "تارا": ['تا', 'را'],
  "مارا": ['ما', 'را'],

  "کسی": ['ک', 'سی'],
  "رو": ['رو'],
  "رُو": ['ر'],
  "دویدن": ['د', 'وی', 'دن'],
  "دویدم": ['د', 'وی', 'دم'],
  "دویدی": ['د', 'وی', 'دی'],
  "دوید": ['د', 'وی', 'د'],
  
  "دویدیم": ['د', 'وی', 'دی', 'م'],
  "دویدید": ['د', 'وی', 'دی', 'د'],
  "دویدند": ['د', 'وی', 'دن', 'د'],
  
  "دهیم": ['د', 'هی', 'م'],
  "دهید": ['د', 'هی', 'د'],
  "دهند": ['د', 'هن', 'د'],

  "ذکر": ['ذک', 'ر'],
  "ردیف": ['ر', 'دی', 'ف'],
  "رفیق": ['ر', 'فی' , 'ق'],
  "سوی": ['سو', 'ی'],

  "لیوان": ['لی', 'وا', 'ن'],
  "لیوانم": ['لی', 'وا', 'نم'],
  "لیوانت": ['لی', 'وا', 'نت'],
  "لیوانش": ['لی', 'وا', 'نش'],
  "لیوانمان": ['لی', 'وا', 'ن', 'ما', 'ن'],
  "لیوانتان": ['لی', 'وا', 'ن', 'تا', 'ن'],
  "لیوانشان": ['لی', 'وا', 'ن', 'شا', 'ن'],
  "خیال": ['خ', 'یا', 'ل'],
  
  "علیم": ['ع', 'لی', 'م'],
  "حکیم": ['ح', 'کی', 'م'],
  "رحیم": ['ر', 'حی', 'م'],
  "شریف": ['ش', 'ری', 'ف'],
  "سلیس": ['س', 'لی', 'س'],
    "فرق": ['فر', 'ق'],
  "فریاد": ['فر', 'یا', 'د'],
  "فریادم": ['فر', 'یا', 'دم'],
  "فریادت": ['فر', 'یا', 'دت'],
  "فریادش": ['فر', 'یا', 'دش'],
  "فریادمان": ['فر', 'یا', 'د', 'ما'],
  "فریادتان": ['فر', 'یا', 'د', 'تا'],
  
  "قند": ['قن', 'د'],

  "قلب": ['قل', 'ب'],
  "قلبم": ['قل', 'بم'],
  "قلبت": ['قل', 'بت'],
  "قلبش": ['قل', 'بش'],
  "قلبمان": ['قل', 'ب', 'ما'],
  "قلبتان": ['قل', 'ب', 'تا'],
  "قلبشان": ['قل', 'ب', 'شا'],

  "قهوه": ['قه', 'و'],
  "غمگین": ['غم', 'گی', 'ن'],
  "غمگینم": ['غم', 'گی', 'نم'],
  "غمگینی": ['غم', 'گی', 'نی'],
  "غمگینه": ['غم', 'گی', 'ن'],
  "غمگینیم": ['غم', 'گی', 'نی', 'م'],
  "غمگینید": ['غم', 'گی', 'نی', 'د'],
  "غمگینند": ['غم', 'گی', 'نن', 'د'],

  "علم": ['عل', 'م'],
  "عشق": ['عش', 'ق'],
  "عشقم": ['عش', 'قم'],
  "عشقت": ['عش', 'قت'],
  "عشقش": ['عش', 'قش'],
  "عاشقان": ['عا', 'ش', 'قا', 'ن'],
  "عروسک": ['ع', 'رو', 'سک'],
  "عروسکم": ['ع', 'رو', 'س', 'کم'],
  "عروسکی": ['ع', 'رو', 'س', 'کی'],
  "عروسکت": ['ع', 'رو', 'س', 'کت'],
  "عروسکش": ['ع', 'رو', 'س', 'کش'],
  
  "عجیب": ['ع', 'جی', 'ب'],
  "طبیعت": ['ط', 'بی', 'عت'],

  
  "کلم": ['ک', 'لم'],
  "کلمه": ['ک', 'ل', 'م'],
  "کلمات": ['ک', 'ل', 'ما', 'ت'],
  "کنایه": ['ک', 'نا', 'ی'],
  "کیک": ['کی', 'ک'],
  "پیک": ['پی', 'ک'],
  "کیکم": ['کی', 'کم'],
  "کیکت": ['کی', 'کت'],
  "کیکش": ['کی', 'کش'],
  "کیکمان": ['کی', 'ک', 'ما'],
  "کیکتان": ['کی', 'ک', 'تا'],
  "کیکشان": ['کی', 'ک', 'شا'],
  "کردم": ['کر', 'دم'],
  "کردی": ['کر', 'دی'],
  "کرد": ['کر', 'د'],
  "کرده": ['کر', 'د'],
  "سرده": ['سر', 'د'],
  "برده": ['بر', 'د'],
  "پرده": ['پر', 'د'],
  "نرده": ['نر', 'د'],
  "ترده": ['تر', 'د'],
  "قطره": ['قط', 'ر'],
  "قلبه": ['قل', 'ب'],

  "کردیم": ['کر', 'دی', 'م'],
  "کردید": ['کر', 'دی', 'د'],
  "کردند": ['کر', 'دن', 'د'],
  "کبوتر": ['ک', 'بو', 'تر'],

  "گریستن": ['گ', 'ری', 'س', 'تن'],
  "گلچین": ['گل', 'چی', 'ن'],
  "گلچینم": ['گل', 'چی', 'نم'],
  "گلچینت": ['گل', 'چی', 'نت'],
  "گلچینش": ['گل', 'چی', 'نش'],
  "گلچینمان": ['گل', 'چی', 'ن', 'ما'],
  "گلچینتان": ['گل', 'چی', 'ن', 'تا'],
  "گلچینشان": ['گل', 'چی', 'ن', 'شا'],

  "گفت": ['گف', 'ت'],
  "مفت": ['مف', 'ت'],
  "سفت": ['سف', 'ت'],
  "جفت": ['جف', 'ت'],

  "گویم": ['گو', 'یم'],
  "گویی": ['گو', 'یی'],
  "گوید": ['گو', 'ید'],
  "گوییم": ['گو', 'یی', 'م'],

  "گویند": ['گو', 'ین', 'د'],

  "هستم": ['هس', 'تم'],
  "هستی": ['هس', 'تی'],
  "هست": ['هس', 'ت'],
  "هستیم": ['هس', 'تی', "م"],
  
  "هستند": ['هس', 'تن', "د"],

  "نباش": ['ن', 'با', 'ش'],
  "نشان": ['ن', 'شا'],
  "نشانم": ['ن', 'شا', 'نم'],
  "نشانت": ['ن', 'شا', 'نت'],
  "نشانش": ['ن', 'شا', 'نش'],

  "نمانم": ['ن', 'ما', 'نم'],
  "نمانی": ['ن', 'ما', 'نی'],
  "نماند": ['ن', 'ما', 'ند'],
  "نمانیم": ['ن', 'ما', 'نی', 'م'],
  "نمانید": ['ن', 'ما', 'نی', 'د'],
  "نمانند": ['ن', 'ما', 'نن', 'د'],
  "همانند": ['ه', 'ما', 'نن', 'د'],

  "نوشته": ['ن', 'وش', 'ت'],
  "نوشتن":['ن', 'وش', 'تن'],
  "نوشتم":['ن', 'وش', 'تم'],
  "نوشتی": ['ن', 'وش', 'تی'],
  "نوشت": ['ن', 'وش', 'ت'],
  "نوشتیم": ['ن', 'وش', 'تی', "م"],
  "نوشتید": ['ن', 'وش', 'تی', "د"],
  "نوشتند": ['ن', 'وش', 'تن', "د"],

  "نویسم": ['ن', 'وی', 'سم'],
  "نویسی": ['ن', 'وی', 'سی'],
  "نویسد": ['ن', 'وی', 'سد'],
  "نویسیم": ['ن', 'وی', 'سی', 'م'],
  "نویسید": ['ن', 'وی', 'سی', 'د'],
  "نویسند": ['ن', 'وی', 'سن', 'د'],

  "نماند": ['ن', 'ما', 'ند'],

  "نبند": ['ن', 'بن', 'د'],

  "حسادت": ['ح','سا', 'دت'],
  "حسادتم": ['ح','سا', 'د', 'تم'],
  "حسادتت": ['ح','سا', 'د', 'تت'],
  "حسادتش": ['ح','سا', 'د', 'تش'],
  "حسادمان": ['ح','سا', 'د', 'ت', 'ما'],
  "حسادتان": ['ح','سا', 'د', 'ت', 'تا'],
  "حسادشان": ['ح','سا', 'د', 'ت', 'شا'],

  "چخوف": ['چ', 'خو', 'ف'],
  "طعنه": ['طع', 'ن'],
  "وقتی": ['وق', 'تی'],

  "ملکا": ['م', 'ل', 'کا'],
  "گفتم": ['گف', 'تم'],
  "گفتی": ['گف', 'تی'],
  "گفته": ['گف', 'ت'],
  "میگفتم": ['می', 'گف', 'تم'],
  "میگفتی": ['می', 'گف', 'تی'],
  "میگفت": ['می', 'گف', 'ت'],
  "میگفتیم": ['می', 'گف', 'تی', 'م'],
  "میگفتید": ['می', 'گف', 'تی', 'د'],
  "میگفتند": ['می', 'گف', 'تن', 'د'],
  "میزنم": ['می', 'ز', 'نم'],
  "میزنی": ['می', 'ز', 'نی'],
  "میزند": ['می', 'ز', 'ند'],
  "میزنیم": ['می', 'ز', 'نی', 'م'],
  "میزنید": ['می', 'ز', 'نی', 'د'],
  "میزنند": ['می', 'ز', 'نن', 'د'],
  
  "میرسد": ['می', 'ر', 'سد'],

  "محرم": ["مح", 'رم'],
  "محرمه": ["مح", 'ر', 'م'],
  "مستطیل": ['مس', 'ت', 'طی', 'ل'],
  "مستطیلم": ['مس', 'ت', 'طی', 'لم'],
  "مستطیلت": ['مس', 'ت', 'طی', 'لت'],
  "مستطیلش": ['مس', 'ت', 'طی', 'لش'],
  "مستطیلمان": ['مس', 'ت', 'طی', 'ل', 'ما'],
  "مستطیلتان": ['مس', 'ت', 'طی', 'ل', 'تا'],
  "مستطیلشان": ['مس', 'ت', 'طی', 'ل', 'شا'],

  "نگفتم": ['ن', 'گف', 'تم'],
  "نمی": ['ن', 'می'],
  "نغمه": ['نغ', 'م'],

  "نهنگ": ['ن', 'هن', 'گ'],
  "نهنگم": ['ن', 'هن', 'گم'],
  "نهنگت": ['ن', 'هن', 'گت'],
  "نهنگش": ['ن', 'هن', 'گش'],
  "نهنگمان": ['ن', 'هن', 'گ', 'ما'],
  "نهنگتان": ['ن', 'هن', 'گ', 'تا'],
  "نهنگشان": ['ن', 'هن', 'گ', 'شا'],

  "نمیدهم": ['ن', 'می', 'د', 'هم'],
  "نمیدهی": ['ن', 'می', 'د', 'هی'],
  "نمیدهد": ['ن', 'می', 'د', 'هد'],
  "نمیدهیم": ['ن', 'می', 'د', 'هی', 'م'],
  "نمیدهید": ['ن', 'می', 'د', 'هی', 'د'],
  "نمیدهند": ['ن', 'می', 'د', 'هن', 'د'],
  
  "وزن": ['وز', 'ن'],
  "وسوسه": ['وس', 'و', 'س'],
  "مفتخر": ['مف', 'ت', 'خر'],
  "مردم": ['مر', 'دم'],
  "مرداس": ['مر', 'دا', 'س'],
  "مرد": ['مر', 'د'],
  "میوه": ['می', 'و'],

  "مرغ": ['مر', 'غ'],
  "مرغم": ['مر', 'غم'],
  "مرغت": ['مر', 'غت'],
  "مرغش": ['مر', 'غش'],
  "مرغمان": ['مر', 'غ', 'ما'],
  "مرغتان": ['مر', 'غ', 'تا'],
  "مرغشان": ['مر', 'غ', 'شا'],

  "میخوانمش": ['می', 'خا', 'ن', 'مش'],
  "مسیری": ['م', 'سی', 'ری'],
  "مبارکست": ['م', 'با', 'رک', 'ک', 'اس' , 'ت'],
  "منیژه": ['م', 'نی', 'ژ'],
  "مهتاب": ['مه', 'تا', 'ب'],
  "معتاد": ['مع', 'تا', 'د'],
  "میام": ['می', 'یا', 'م'],
  "میای": ['می', 'یا', 'ی'],
  "بالای": ['با', 'لا', 'ی'],
  "میاد": ['می', 'یا', 'د'],
  "میایم": ['می', 'یا', 'یم'],
  "میاین": ['می', 'یا', 'ین'],
  "میان": ['می', 'یا'],
  "مثل": ['مث', 'ل'],

  "یاد": ['یا', 'د'],
  "یادگار": ['یا', 'د', 'گا', 'ر'],
  "یادگاری": ['یا', 'د', 'گا', 'ری'],
  "یار": ['یا', 'ر'],
  "یکی": ['ی', 'کی'],
  "یاس": ['یا', 'س'],
  "یاسم": ['یا', 'سم'],
  "یاسی": ['یا', 'سی'],
  "یوز": ['یو', 'ز'],
  "یوزم": ['یو', 'زم'],
  "یوزی": ['یو', 'زی'],

  "ویران": ['وی', 'را', 'ن'],
  "ویرانم": ['وی', 'را', 'نم'],
  "ویرانی": ['وی', 'را', 'نی'],
  "ویرانیم": ['وی', 'را', 'نی', 'م'],
  "ویرانید": ['وی', 'را', 'نی', 'د'],
  "ویرانند": ['وی', 'را', 'نن', 'د'],
  "همیشه": ['ه', 'می', 'ش'],
  "آنتوان": ["ءا", "ن", "ت", "وا", "ن"],
  "بامدادی": ['با', 'م', 'دا', 'دی'],
  "باید": ['با', 'ید'],
  "بیشتر": ['بی', 'ش', 'تر'],
  "بیشترم": ['بی', 'ش', 'ت', 'رم'],
  "بیشترش": ['بی', 'ش', 'ت', 'رش'],
  "برتره": ['بر', 'ت', 'ر'],
  "پیشرفت": ['پی', 'ش', 'رف', 'ت'],

  "پارس": ['پا', 'ر', 'س'],
  "صفتاش": ['ص', 'ف', 'تا', 'ش'],
  "ببین": ['ب', 'بی', 'ن'],
  "دلمان": ["د", 'ل', 'ما'],
  "دلتان": ["د", 'ل', 'تا'],
  "دلشان": ["د", 'ل', 'شا'],

  "جهودن": ['ج', 'هو', 'دن'],
  "نبودن": ['ن', 'بو', 'دن'],
  "ربودن": ['ر', 'بو', 'دن'],
  "کبودن": ['ک', 'بو', 'دن'],
  "جنودن": ['ج', 'نو', 'دن'],
  "عمودن": ['ع', 'مو', 'دن'],
  "خمودن": ['خ', 'مو', 'دن'],
  "یهودن": ['ی', 'هو', 'دن'],
  "زدودن": ['ز', 'دو', 'دن'],
  "سرودن": ['س', 'رو', 'دن'],
  "گشودن": ['گ', 'شو', 'دن'],
  "ستودن": ['س', 'تو', 'دن'],
  "نمودن": ['ن', 'مو', 'دن'],

  "مادرم": ['ما', 'د', 'رم'],

  "خسته": ['خس', 'ت'],
  "بسته": ['بس', 'ت'],
  "رفته": ['رف', 'ت'],
  "دسته": ['دس', 'ت'],
  "جسته": ['جس', 'ت'],
  "مسته": ['مس', 'ت'],
  "رسته": ['رس', 'ت'],
  "هسته": ['هس', 'ت'],
  "شسته": ['شس', 'ت'],
  "خسته": ['خس', 'ت'],
  "تیکه": ['تی', 'ک', 'ک'],

  "جهادی": ['ج', 'ها', 'دی'],
  "تکاندی": ['ت', 'کا', 'ن' ,'دی'],
  "زماندی": ['ز', 'ما', 'ن' ,'دی'],
  "جهاندی": ['ج', 'ها', 'ن' ,'دی'],
  "رواندی": ['ر', 'وا', 'ن' ,'دی'],
  "کماندی": ['ک', 'ما', 'ن' ,'دی'],
  "نماندی": ['ن', 'ما', 'ن' ,'دی'],
  "اماندی": ['ا', 'ما', 'ن' ,'دی'],


  "اینگونه": ['ای', 'ن', 'گو', 'ن'],
  "زمونه": ['ز', 'مو', 'ن'],
  "کمونه": ['ک', 'مو', 'ن'],
  "تمومه": ['ت', 'مو', 'م'],
  "حمومه": ['ح', 'مو', 'م'],

  "چرندی": ['چ', 'رن', 'دی'],
  "کمندی": ['ک', 'من', 'دی'],
  "رنگی": ['رن', 'گی'],
  "بنگی": ['بن', 'گی'],
  "دنگی": ['دن', 'گی'],
  "تنگی": ['تن', 'گی'],
  "سنگی": ['سن', 'گی'],
  "چنگی": ['چن', 'گی'],
  "جنگی": ['جن', 'گی'],
  "کنگی": ['کن', 'گی'],
  "شنگی": ['شن', 'گی'],
  "هنگی": ['هن', 'گی'],
  "منگی": ['من', 'گی'],
  "خنگی": ['خن', 'گی'],
  "گنگی": ['گن', 'گی'],
  "سندی": ['سن', 'دی'],
  "مندی": ['من', 'دی'],
  "کندی": ['کن', 'دی'],

  "کتاب": ['ک', 'تا', 'ب'],
  "کباب": ['ک', 'با', 'ب'],
  "حساب": ['ح', 'سا', 'ب'],
  "شهاب": ['ش', 'ها', 'ب'],
  "رکاب": ['ر', 'کا', 'ب'],
  "عقاب": ['ع', 'قا', 'ب'],
  "نقاب": ['ن', 'قا', 'ب'],
  "گلاب": ['گ', 'لا', 'ب'],
  "حباب": ['ح', 'با', 'ب'],
  "حجاب": ['ح', 'جا', 'ب'],
  "جناب": ['ج', 'نا', 'ب'],
  "طناب": ['ط', 'نا', 'ب'],
  "خطاب": ['خ', 'طا', 'ب'],

  "ناصحان": ['نا', 'ص', 'حا'],
  "دوباره": ['د', 'با', 'ر'],
  "خویشتن": ['خی', 'ش', 'تن'],
  "خویش": ['خی', 'ش'],
  "مرا": ['م', 'را'],
  "قبیله": ['ق', 'بی', 'ل'],
  "زهدم": ['زه', 'دم'],
  "گذارم": ['گ', 'ذا', 'رم'],
  "گذاری": ['گ', 'ذا', 'ری'],
  "گذارد": ['گ', 'ذا', 'رد'],
  "قلم": ['ق', 'لم'],
  "جادوی": ['جا', 'دو', 'ی'],
  "نشستم": ['ن', 'شس', 'تم'],
  "سرایم": ['س', 'را' , 'یم'],
  "قلمم": ['ق', 'ل', 'مم'],
  "قلمت": ['ق', 'ل', 'مت'],
  "قلمش": ['ق', 'ل', 'مش'],
  "منظره": ['من', 'ظ', 'ر'],
  "توصیف": ['ت', 'صی', 'ف'],
  "ابروی": ['اب', 'رو', 'ی'],

  "خانه": ['خا', 'ن'],
  "شانه": ['شا', 'ن'],
  "بانه": ['با', 'ن'],
  "سایه": ['سا', 'ی'],
  "پایه": ['پا', 'ی'],
  "دایه": ['دا', 'ی'],
  "دایت": ['دا', 'یت'],
  "کاهت": ['کا', 'هت'],
  "لایه": ['لا', 'ی'],
  "آخه": ['ءا', 'خ'],
  "ساده": ['سا', 'د'],

  "جادویی": ['جا', 'د', 'یی'],
  "چترباز": ['چت', 'ر', 'با', 'ز'],
}

// wordList = [];

const dbSyllables = {
  'یک': '-',
  'دو': '-',
  'سه': '-',
  // ا
  'اب': '-',
  'اپ': '-',
  'اث': '-',
  'اج': '-',
  'اح': '-',
  'اخ': '-',
  'اد': '-',
  'اذ': '-',
  'ار': '-',
  'از': '-',
  'اژ': '-',
  'اس': '-',
  'اش': '-',
  'اص': '-',
  'اض': '-',
  'اط': '-',
  'اظ': '-',
  'اع': '-',
  'اغ': '-',
  'اف': '-',
  'اق': '-',
  'اک': '-',
  'ال': '-',
  'ام': '-',
  'ان': '-',
  'او': '-',
  'اه': '-',
  'ای': '-',
  // ب
  'با': '-',
  'بب': '-',
  'بپ': '-',
  'بت': '-',
  'بج': '-',
  'بچ': '-',
  'بح': '-',
  'بخ': '-',
  'بد': '-',
  'بذ': '-',
  'بر': '-',
  'بز': '-',
  'بژ': '-',
  'بس': '-',
  'بش': '-',
  'بص': '-',
  'بض': '-',
  'بط': '-',
  'بع': '-',
  'بغ': '-',
  'بف': '-',
  'بک': '-',
  'بگ': '-',
  'بل': '-',
  'بم': '-',
  'بن': '-',
  'بو': '-',
  'بی': '-',
  'به': '-',
  // پ
  'پا': '-',
  'پپ': '-',
  'پت': '-',
  'پچ': '-',
  'پخ': '-',
  'پد': '-',
  'پذ': '-',
  'پر': '-',
  'پز': '-',
  'پژ': '-',
  'پس': '-',
  'پش': '-',
  'پغ': '-',
  'پف': '-',
  'پک': '-',
  'پگ': '-',
  'پل': '-',
  'پم': '-',
  'پن': '-',
  'پو': '-',
  'په': '-',
  'پی': '-',
  // ت
  'تا': '-',
  'تب': '-',
  'تپ': '-',
  'تت': '-',
  'ته': '-',
  'تح': '-',
  'تخ': '-',
  'تج': '-',
  'تف': '-',
  'تس': '-',
  'تش': '-',
  'تل': '-',
  'تم': '-',
  'تک': '-',
  'تگ': '-',
  'تن': '-',
  'تر': '-',
  'تز': '-',
  'تو': '-',
  'تص': '-',
  'تد': '-',
  'تی': '-',
  // ث
  'ثا': '-',
  'ثب': '-',
  'ثت': '-',
  'ثخ': '-',
  'ثن': '-',
  // ج
  'جا': '-',
  'جب': '-',
  'جت': '-',
  'جج': '-',
  'جخ': '-',
  'جر': '-',
  'جز': '-',
  'جس': '-',
  'جش': '-',
  'جل': '-',
  'جم': '-',
  'جن': '-',
  'جو': '-',
  'جی': '-',
  // چ
  'چا': '-',
  'چب': '-',
  'چت': '-',
  'چخ': '-',
  'چر': '-',
  'چس': '-',
  'چش': '-',
  'چل': '-',
  'چم': '-',
  'چن': '-',
  'چو': '-',
  'چی': '-',
  'جه': '-',
  // ح
  'حا': '-',
  'حب': '-',
  'حت': '-',
  'حج': '-',
  'حر': '-',
  'حس': '-',
  'حش': '-',
  'حل': '-',
  'حم': '-',
  'حن': '-',
  'حو': '-',
  'حی': '-',
  // خ
  'خا': '-',
  'خج': '-',
  'خد': '-',
  'خر': '-',
  'خش': '-',
  'خط': '-',
  'خل': '-',
  'خم': '-',
  'خن': '-',
  'خو': '-',
  'خس': '-',
  'خی': '-',
  // د
  'دا': '-',
  'دب': '-',
  'دت': '-',
  'دج': '-',
  'در': '-',
  'دس': '-',
  'دش': '-',
  'دل': '-',
  'دم': '-',
  'دن': '-',
  'دو': '-',
  'دی': '-',
  // ذ
  'ذو': '-',
  'ذی': '-',
  // ر
  'را': '-',
  'رب': '-',
  'رپ': '-',
  'رت': '-',
  'رج': '-',
  'رح': '-',
  'رخ': '-',
  'رد': '-',
  'رذ': '-',
  'رر': '-',
  'رز': '-',
  'رژ': '-',
  'رس': '-',
  'رش': '-',
  'رع': '-',
  'رغ': '-',
  'رف': '-',
  'رک': '-',
  'رگ': '-',
  'رل': '-',
  'رم': '-',
  'رو': '-',
  'ری': '-',
  // ز
  'زا': '-',
  'زب': '-',
  'زت': '-',
  'زج': '-',
  'زر': '-',
  'زس': '-',
  'زش': '-',
  'زل': '-',
  'زم': '-',
  'زن': '-',
  'زو': '-',
  'زی': '-',
  // ژ
  'ژا': '-',
  'ژب': '-',
  'ژت': '-',
  'ژر': '-',
  'ژس': '-',
  // س
  'سا': '-',
  'سب': '-',
  'ست': '-',
  'سج': '-',
  'سر': '-',
  'سز': '-',
  'سش': '-',
  'سل': '-',
  'سم': '-',
  'سن': '-',
  'سو': '-',
  'سه': '-',
  'سی': '-',
  // ش
  'شا': '-',
  'شب': '-',
  'شت': '-',
  'شج': '-',
  'شر': '-',
  'شس': '-',
  'شع': '-',
  'شل': '-',
  'شم': '-',
  'شن': '-',
  'شو': '-',
  'شی': '-',
  // ص
  'صا': '-',
  'صب': '-',
  'صت': '-',
  'صن': '-',
  'صو': '-',
  'صی': '-',
  // ض
  'ضا': '-',
  'ضب': '-',
  'دت': '-',
  'ضر': '-',
  'دس': '-',
  'دش': '-',
  // ط
  'طا': '-',
  'طب': '-',
  'تت': '-',
  'طر': '-',
  'تس': '-',
  // ظ
  'ظا': '-',
  'ظب': '-',
  'ظت': '-',
  'ظن': '-',
  'ظم': '-',
  // ع
  'عا': '-',
  'عب': '-',
  'عت': '-',
  'عج': '-',
  'عر': '-',
  'عز': '-',
  'عس': '-',
  'عش': '-',
  'عل': '-',
  'عم': '-',
  'عن': '-',
  'عو': '-',
  'عی': '-',
  // غ
  'غا': '-',
  'غب': '-',
  'غت': '-',
  'غر': '-',
  'غس': '-',
  'غم': '-',
  'غش': '-',
  // ف
  'فا': '-',
  'فب': '-',
  'فت': '-',
  'فج': '-',
  'فر': '-',
  'فز': '-',
  'فس': '-',
  'فش': '-',
  'فل': '-',
  'فم': '-',
  'فن': '-',
  'فو': '-',
  'فی': '-',
  // ق
  'قا': '-',
  'قب': '-',
  'قت': '-',
  'قج': '-',
  'قر': '-',
  'قز': '-',
  'قس': '-',
  'قش': '-',
  'قل': '-',
  'قم': '-',
  'قن': '-',
  'قو': '-',
  'قی': '-',
  // ک
  'کا': '-',
  'کب': '-',
  'کت': '-',
  'کج': '-',
  'کر': '-',
  'کز': '-',
  'کس': '-',
  'کش': '-',
  'کل': '-',
  'کم': '-',
  'کن': '-',
  'کو': '-',
  'کی': '-',
  // گ
  'گا': '-',
  'گب': '-',
  'گت': '-',
  'گج': '-',
  'گر': '-',
  'گس': '-',
  'گش': '-',
  'گل': '-',
  'گم': '-',
  'گن': '-',
  'گو': '-',
  'گی': '-',
  // ل
  'لا': '-',
  'لب': '-',
  'لت': '-',
  'لج': '-',
  'لر': '-',
  'لز': '-',
  'لس': '-',
  'لش': '-',
  'لک': '-',
  'لم': '-',
  'لن': '-',
  'لو': '-',
  'لی': '-',
  // م
  'ما': '-',
  'مب': '-',
  'مت': '-',
  'مج': '-',
  'مح': '-',
  'مخ': '-',
  'مر': '-',
  'مز': '-',
  'مس': '-',
  'مش': '-',
  'مق': '-',
  'مل': '-',
  'مم': '-',
  'من': '-',
  'مو': '-',
  'می': '-',
  // ن
  'نا': '-',
  'نب': '-',
  'نت': '-',
  'نج': '-',
  'نر': '-',
  'نز': '-',
  'نس': '-',
  'نش': '-',
  'نل': '-',
  'نم': '-',
  'نن': '-',
  'نو': '-',
  'نی': '-',
  'نه': '-',
  // ه
  'ها': '-',
  'هب': '-',
  'هت': '-',
  'هج': '-',
  'هر': '-',
  'هز': '-',
  'هس': '-',
  'هش': '-',
  'هل': '-',
  'هم': '-',
  'هن': '-',
  'هو': '-',
  'هی': '-',
};

const baseWordShape = {}
Object.keys(baseWord).forEach((key) => {
  const shape = baseWord[key].map(syllable => syllable.length === 1 ? 'U' : '-').join('');
  baseWordShape[key] = shape;
});

function getShapeOfWord(inputArray)
{
  return inputArray.map(syllable => syllable.length === 1 ? 'U' : '-').join('');
}

// مرتب‌سازی ارکان بر اساس طول
const sortedWords = Object.keys(baseWord).sort((a, b) => baseWord[b].join('').length - baseWord[a].join('').length);

function findCombinations(inputShape, startIndex = 0) {
  const currentCombination = [];
  while(startIndex < inputShape.length) {
    // console.log(startIndex, currentCombination)
    let addBase = false;
    for (const base of  sortedWords) {
      const length = baseWordShape[base].length;
      const subShape = inputShape.substring(startIndex, startIndex + length);
      if(subShape == baseWordShape[base])
      {
        currentCombination.push(base);
        startIndex += length;
        addBase = true;
        break;
      }
    }
    if(!addBase)
    {
      const subShape = inputShape.substring(startIndex);
      currentCombination.push(subShape);
      break;
    }
  }
  return currentCombination;
}


// این حروف میتوانند هم نشانه صامت باشند و هم مصوت.
function isSmallVowels(char) {
  return char === 'و' || char === 'ا' || char === 'ه' || char === 'ی'; // اضافه کردن شرایط خاص
}

// function isBigVowels()
// {
//   return char === 'گ' || char === 'ث'; // اضافه کردن شرایط خاص
// }

function isMidelVowels(char) {
  return char === 'ل' || char === 'ر' || char === 'ز'; // اضافه کردن شرایط خاص
}

function extractSyllablesV(words, syllables, i)
{
  let lastWord = '';
  let lastChar = '';
  if(i>0)
  {
    lastWord = words[i-1];
    lastChar = lastWord.slice(lastWord.length - 1);
  }
  const lastSyllableIndex = syllables.length -1;
  let lastSyllable = syllables[lastSyllableIndex];
  if(lastSyllable != null)
  {
    // console.log(lastSyllable.slice(lastSyllable.length -1));
    if(lastSyllable.slice(lastSyllable.length -1) != lastChar)
    {
      return [`${lastChar}و`];
    }
    else
    {
      if(lastSyllable.length == 1)
      {
        syllables[lastSyllableIndex] = lastSyllable + 'و';
        return [];
      }
      else
      {
        return [lastChar + 'و'];
      }
    }
    
    // else
    // {
    //   const lastCharIndex = lastSyllable.length - 1;
    //   return [lastSyllable.charAt(lastCharIndex) + 'و']
    // }
    return 'و';
  }
  else
  {
    return 'و';
  }
}

function extractSyllablesAndLettersFromWord(word, syllables) {
  const result = [];
  let i = 0;
  while (i < word.length) {
    const twoChars = word.slice(i, i + 2);
    const firstChar = word.slice(i, i + 1);
    const secChar = word.slice(i+1, i + 2);
    const thirdChar = word.slice(i+2, i + 3);
    // console.log(twoChars, i);
    if (word.length - i == 1 && firstChar == 'ن' && syllables[-1] == 'با') {
      break; // پایان حلقه
    }
    if (word.length - i < 3) {
      // console.log(word.slice(i, word.length));
      result.push(word.slice(i)); // اضافه کردن کاراکتر باقی‌مانده
      break; // پایان حلقه
    }

    if(twoChars == 'ءا') { result.push('ءا'); i+= 2; continue;}
    if(word.length == 3 && isSmallVowels(secChar)) { result.push(`${firstChar}${secChar}`); i+= 2; continue; }
    if(isSmallVowels(firstChar) && isSmallVowels(secChar)) { result.push(`${firstChar}${secChar}`); i+= 2; continue; }
    if(isSmallVowels(secChar) && isSmallVowels(thirdChar)) {
      result.push(firstChar);
      result.push(`${secChar}${thirdChar}`);
      i+= 3;
      continue;
    }
    
    if (dbSyllables[twoChars] != null) {
      result.push(twoChars);
      i += 2; // دو کاراکتر را گذر می‌کنیم
    } else {
      result.push(word.charAt(i)); // اضافه کردن یک کاراکتر به نتیجه
      i += 1; // یک کاراکتر را گذر می‌کنیم
    }
  }
  return result;
}

function checkComma(words, i)
{
  if(i == 0) { return false }
  const lastWord = words[i-1];
  const currWord = words[i];
  const endCharLastWord = lastWord[lastWord.length - 1];
  if(endCharLastWord == '،' && currWord.length == 1 )
  {
    return [currWord];
  }
  else
  {
    return false;
  }
}

function filterWordChar(str)
{
  let newWord = str.replaceAll('خوا', 'خا');
  newWord = newWord.replaceAll('آ', 'ءا');
  return newWord;
}

function filterWordSpecialChar(str)
{
  let newWord = str.replaceAll('+', '');
  newWord = newWord.replaceAll('،', '');
  return newWord;
}

function extractSyllablesAndLettersFromText(text) {
  const cleanedText = text.replace(/[.'"\]\[؟?,\/#!$%\^&\*;:{}=\-_`~()«»]/g, '').replace(/\s+/g, ' ').trim();
  const words = cleanedText.split(' ');
  const allResults = [];

  words.forEach((word, i) => {
    // این قسمت برای اینه که اگر خواستیم و یک هجای جداگانه حساب بشه با کاما جدا میکنیمش
    const comma = checkComma(words, i);
    let syllablesAndLetters = [];
    let newWord = filterWordSpecialChar(filterWordChar(word));
    if(comma != false)
    {
      if(wordList[filterWordSpecialChar(word)] != null)
      {
        syllablesAndLetters = wordList[filterWordSpecialChar(word)];
      }
      else
      {
        syllablesAndLetters = comma;
      }
      
    }
    else if(newWord == 'و')
    {
      syllablesAndLetters = extractSyllablesV(words, allResults, i);
      allResults.push(...syllablesAndLetters);
      return;
    }
    else
    {
      // if(newWord.length < 3)
      // {
      //   syllablesAndLetters = extractSyllablesAndLettersFromSmallWord(newWord);
      // }
      // else
      // {
        // console.log(wordList[newWord], newWord);
        if(wordList[filterWordSpecialChar(word)] != null)
        {
          syllablesAndLetters = wordList[filterWordSpecialChar(word)];
        }
        else
        {
          syllablesAndLetters = extractSyllablesAndLettersFromWord(newWord, allResults);
          // console.log(syllablesAndLetters);
        }
      // }
    }
    allResults.push(...syllablesAndLetters); // اضافه کردن به آرایه کلی
  });

  return allResults;
}
