let acceptWordList = {
  "به": ['ب'],
  "تو": ['ت'],
  "چه": ["چ"],
  "سه": ['س'],
  "که": ['ک'],
  "یه": ['ی'],
  "نه": ['ن'],

  "بَه": ['به'],
  "چَه": ['چه'],
  "ره": ['ره'],
  "ته": ['ته'],
  "شب": ['شب'],

  "پر": ['پر'],
  "پَر": ['پر'],
  "پُر": ['پر'],
  "فر": ['فر'],
  "فِر": ['فر'],
  "سر": ['سر'],
  "سُر": ['سر'],

  "همه": ['ه', 'م'],
  "کمه": ['ک', 'م'],
  "شبه": ['ش', 'ب'],
  "رمه": ['ر', 'م'],
  "دمه": ['د', 'م'],
  "بمه": ['ب', 'م'],
  "زنه": ['ز', 'ن'],
  "چمه": ['چ', 'م'],


  "بزن": ['ب', 'زن'],
  "بدن": ['ب', 'دن'],
  "تنم": ['ت', 'نم'],
  "تنت": ['ت', 'نت'],
  "تنش": ['ت', 'نش'],
  "سرم": ['س', 'رم'],
  "دهم": ['د', 'هم'],
  "دهی": ['د', 'هی'],
  "دهد": ['د', 'هد'],
  "زره": ['ز', 'ره'],
  "قمر": ['ق', 'مر'],
  "جنم": ['ج', 'نم'],
  "عجب": ['ع', 'جب'],
  "هوس": ['ه', 'وس'],
  "کنم": ['ک', 'نم'],
  "منم": ['م', 'نم'],
  "وطن": ['و', 'طن'],
  "زنم": ['ز', 'نم'],
  "زنت": ['ز', 'نت'],
  "زنش": ['ز', 'نش'],
  "صنم": ['ص', 'نم'],
  "شَوی": ['ش', 'وی'],
  "دیده": ['دی', 'د'],


  "دود": ['دو'],
  "کود": ['کو'],
  "جود": ['جو'],
  "سود": ['سو'],
  "بود": ['بو'],
  "زود": ['زو'],
  "عود": ['عو'],
  "مود": ['مو'],
  "هود": ['هو'],
  "پود": ['پو'],
  "رود": ['رو'],
  "چود": ['چو'],
  "نود": ['نو'],
  "فود": ['فو'],
  "قود": ['قو'],
  "تود": ['تو'],
  "خود": ['خو'],
  "شود": ['شو'],
  "لود": ['لو'],
  "گود": ['گو'],



  "بند": ['بن'],
  "قند": ['قن'],
  "شوی": ['شو'],

  "ارزش": ['ار', 'زش'],
  "ارزد": ['ار', 'زد'],


  "انبار": ['ان', 'با'],
  "ادبان": ['ا', 'د', 'با'],
  "آرش": ["ءا", 'رش'],

  "آب": ["ءا", 'ب'],
  "آن": ["ءا", 'ن'],
  "این":['ای', 'ن'],
  

  "آغوشمان": ["ءا", 'غو', 'ش', 'ما'],
  "آغوشتان": ["ءا", 'غو', 'ش', 'تا'],
  "آغوششان": ["ءا", 'غو', 'ش', 'شا'],
  "آلمانی": ["ءا", 'ل', 'ما', 'نی'],
  
  
  "برا": ['ب', 'را'],
  "برای": ['ب', 'را', 'ی'],
  "بچه": ['ب', 'چه'],
  "بلبل": ['بل', 'بل'],
  "بیابان": ['ب', 'یا', 'با'],
  "بسوز":['ب', 'سو', 'ز'],


  "زنان":['ز', 'نا'],

  "سیاهی": ['سی', 'یا', 'هی'],
  
  "چرا": ['چ', 'را'],

  "مبادا":['م', 'با', 'دا'],
  "ماهی": ['ما', 'هی'],
  "بیا":['بی', 'یا'],
  "نیاز":['نی', 'یا', 'ز'],
  "نمک":['ن', 'مک'],
  "حرامان":['ح', 'را', 'ما'],
  "چو": ['چ'],
  "رفاقت":['ر', 'فا', 'قت'],
  "بساز":['ب', 'سا', 'ز'],
  "مسیر":['م', 'سی', 'ر'],
  "توام":['تو', 'ام'],
  "کنون":['ک', 'نو'],
  "نفرین":['نف', 'ری'],
  "گویمت":['گو', 'ی', 'مت'],
  "دعای":['د', 'عا', 'ی'],
  "دیازپام":['دی', 'یا', 'ز', 'پا', 'م'],
  "نماز":['ن', 'ما', 'ز'],
  "همچو": ['هم', 'چ'],
  "گریبان":['گ', 'ری', 'با'],
  "صبر": ['صب'],
  "اما": ['ام', 'ما'],
  "آخرش": ['ءا', 'خ', 'رش'],
  "آدمی": ['ءا', 'د', 'می'],
  "آدمم": ['ءا', 'د', 'مم'],
  "آرشم": ["ءا", 'ر', 'شم'],
  "آرشت": ["ءا", 'ر', 'شت'],
  "آرشش": ["ءا", 'ر', 'شش'],
  "آرشمان": ["ءا", 'رش', 'ما'],
  "آرشتان": ["ءا", 'رش', 'تا'],
  "آرششان": ["ءا", 'رش', 'شا'],


  "دیوانه": ['دی', 'وا', 'ن'],

  "آغوش": ["ءا", 'غو'],
  "آغوشم": ["ءا", 'غو', 'شم'],
  "آغوشت": ["ءا", 'غو', 'شت'],
  "آغوشش": ["ءا", 'غو', 'شش'],
  
  "برایم": ['ب', 'را', 'یم'],
  "برایت": ['ب', 'را', 'یت'],
  "برایش": ['ب', 'را', 'یش'],
  "برایمان": ['ب', 'را', 'ی', 'ما'],
  "برایتان": ['ب', 'را', 'ی', 'تا'],
  "برایشان": ['ب', 'را', 'ی', 'شا'],
  "برام": ['ب', 'را'],
  "برات": ['ب', 'را'],
  "براش": ['ب', 'را'],
  "برامون": ['ب', 'را', 'مو'],
  "براتون": ['ب', 'را', 'تو'],
  "براشون": ['ب', 'را', 'شو'],
  "بسیار": ['بس', 'یا'],
  "باهام": ['با', 'ها'],
  "باهات": ['با', 'ها'],
  "باهاش": ['با', 'ها'],

  "بدانم": ['ب', 'دا', 'نم'],
  "بدانی": ['ب', 'دا', 'نی'],
  "بداند": ['ب', 'دا', 'ن'],
  "بدانیم": ['ب', 'دا', 'نی'],
  "بدانید": ['ب', 'دا', 'نی'],
  "بدانند": ['ب', 'دا', 'نن'],

  "بدون": ['ب', 'دو'],
  "بفروشم": ['بف', 'رو', 'ش'],
  "بفروشی": ['بف', 'رو', 'شی'],
  "بفروشد": ['بف', 'رو', 'شد'],
  "بفروشیم": ['بف', 'رو', 'شی'],
  "بفروشید": ['بف', 'رو', 'شی'],
  "بفروشند": ['بف', 'رو', 'شن'],

  "برهانم": ['ب', 'ر', 'ها', 'نم'],
  "برهانی": ['ب', 'ر', 'ها', 'نی'],
  "برهاند": ['ب', 'ر', 'ها', 'ند'],
  "برهانیم": ['ب', 'ر', 'ها', 'نی'],
  "برهانید": ['ب', 'ر', 'ها', 'نی'],
  "برهانند": ['ب', 'ر', 'ها', 'نن'],
  "بگرد": ['ب', 'گر'],
  "بگردم": ['ب', 'گر', 'دم'],
  "بگردی": ['ب', 'گر', 'دی'],
  "بگردد": ['ب', 'گر', 'د'],
  "بگردیم": ['ب', 'گر', 'دی'],
  "بگردید": ['ب', 'گر', 'دی'],
  "بگردند": ['ب', 'گر', 'دن'],

  "برترین": ['بر', 'تر', 'ری'],
  "برترم": ['بر', 'تر', 'م'],
  "برتری": ['بر', 'تر', 'ی'],
  "برتریم": ['بر', 'تر', 'ری', 'م'],
  "برترید": ['بر', 'تر', 'ری'],
  "برترند": ['بر', 'تر', 'رن'],

  "گویید":  ['گو', 'یی'],
  "هستید":  ['هس', 'تی'],
  "بینید":  ['بی', 'نی'],
  "سیرید":  ['سی', 'ری'],
  "رفتید":  ['رف', 'تی'],
  "دیدید":  ['دی', 'دی'],
  "فهمید":  ['فه', 'می'],
  "آیید":   ['ءا', 'یی'],
  "ناهید":  ['نا', 'هی'],
  "نارید":  ['نا', 'ری'],
  "جاوید":  ['جا', 'وی'],
  "جارید":  ['جا', 'ری'],
  "کاهید":  ['کا', 'هی'],
  "سایید":  ['سا', 'یی'],
  "سابید":  ['سا', 'بی'],
  "قاپید":  ['قا', 'پی'],
  "بافید":  ['با', 'فی'],
  "بارید":  ['با', 'ری'],
  "لافید":   ['لا', 'فی'],
  "دافید":  ['دا', 'فی'],
  "داغید":  ['دا', 'غی'],
  "حالید":  ['حا', 'لی'],
  "زایید":  ['زا', 'یی'],
  "زارید":  ['زا', 'ری'],
  "کارید":  ['کا', 'ری'],
  "مالید":  ['ما', 'لی'],
  "سالید":  ['سا', 'لی'],
  "پایید":  ['پا', 'یی'],
  "پاشید":  ['پا', 'شی'],
  "کاوید":  ['کا', 'وی'],
  "خواهید": ['خا', 'هی'],
  "خوابید": ['خا', 'بی'],
  "خامید": ['خا', 'می'],
  "خاصید":  ['خا', 'صی'],
  "هارید":  ['ها', 'ری'],
  "گاوید":  ['گا', 'وی'],
  "مارید":  ['ما', 'ری'],

  "پروانه": ['پر', 'وا', 'ن'],
  "پرنده": ['پ', 'رن', 'د'],
  "رسیده": ['ر', 'سی', 'د'],
  "ندیده": ['ن', 'دی', 'د'],
  "تلخ": ['تل'],
  "تجربه": ['تج', 'ر', 'ب'],
  
  "ترسو": ['تر', 'سو'],
  "تعریف": ['تع', 'ری'],
  "تعریفی": ['تع', 'ری', 'فی'],
  "تعریفم": ['تع', 'ری', 'فم'], 
  "تعریفت": ['تع', 'ری', 'فت'], 
  "تعریفش": ['تع', 'ری', 'فش'], 
  "تلاش": ['ت', 'لا'],
  "تلاشش": ['ت', 'لا', 'شش'],
  "تلاشم": ['ت', 'لا', 'شم'],
  "تلاشت": ['ت', 'لا', 'شت'],

  "مردانه": ['مر', 'دا', 'ن'],
  "زنانه": ['ز', 'نا', 'ن'],
  "مهدی": ['مه', 'دی'],

  "خفتم": ['خف', 'تم'],
  "خفتی": ['خف', 'تی'],
  "خفت": ['خف'],
  "خفته": ['خف', 'ت'],

  "جاهل": ['جا', 'هل'],
  "ژاپن": ['ژا', 'پن'],
  "ژاپنی": ['ژا', 'پ', 'نی'],
  "روان": ['ر', 'وا'],
  "روانم": ['ر', 'وا', 'نم'],
  "روانت": ['ر', 'وا', 'نت'],
  "روانش": ['ر', 'وا', 'نش'],
  "ربود": ['ر', 'بو'],
  "ربودم": ['ر', 'بو', 'د'],
  "ربودی": ['ر', 'بو', 'دی'],
  "ربودش": ['ر', 'بو', 'د'],

  "زنانه": ['ز', 'نا', 'ن'],
  "سخت": ['سخ'],
  "سردمه": ['سر', 'د', 'م'],
  "سردم": ['سر', 'دم'],
  "سردت": ['سر', 'د'],
  "سردش": ['سر', 'دش'],
  "سردمان": ['سر', 'د', 'ما'],
  "سردتان": ['سر', 'د', 'تا'],
  "سردشان": ['سر', 'د', 'شا'],

  "سلایق": ['س', 'لا', 'ی'],
  "علایق": ['ع', 'لا', 'ی'],
  "شقایق": ['ش', 'قا', 'ی'],
  "سلایقم": ['س', 'لا', 'ی', 'قم'],
  "علایقم": ['ع', 'لا', 'ی', 'قم'],
  "علایقمم": ['ع', 'لا', 'ی', 'ق', 'مم'],
  "غافلم": ['غا', 'ف', 'ل'],
  "عاقلم": ['عا', 'ق', 'ل'],
  "بالغم": ['با', 'ل', 'غ'],

  "نزا": ['ن', 'زا'],
  "لذا": ['ل', 'ذا'],
  "رضا": ['ر', 'ضا'],
  "عوض": ['ع', 'وض'],
  "منو": ['م', 'نو'],

  "خاطرات": ['خا', 'ط', 'را'],
  "خاطراتت": ['خا', 'ط', 'را', 'تت'],
  
  "قایق": ['قا', 'ی'],
  "لایق": ['لا', 'ی'],
  "رو": ['رو'],
  "نمیشه": ['ن', 'می', 'ش'],
  "میمونه": ['می', 'مو', 'ن'],
  "منی": ['م', 'نی'],
  "همراه": ['هم', 'را'],
  "همراهی": ['هم', 'را', 'هی'],
  "همون": ['ه', 'مو'],
  "گلوله": ['گ', 'لو', 'ل'],
  "شکوفه": ['ش', 'کو', 'ف'],
  "دوچرخه": ['دو', 'چر', 'خ'],
  "درده": ['در', 'د'],
  "دلباخته": ['دل', 'با', 'خ', 'ت'],
  "دلواپس": ['دل', 'وا', 'پ'],
  "خوشمزه": ['خو', 'ش', 'مز', 'ز'],
  "جرعه": ['جر', 'ع'],
  "قافیه": ['قا', 'فی', 'ی'],
  "غریبه": ['غ', 'ری', 'ب'],

  "سردادم": ['سر', 'دا', 'د'],
  "سردادی": ['سر', 'دا', 'دی'],
  "سرداد": ['سر', 'دا'],
  "سردادیم": ['سر', 'دا', 'دی'],
  "سردادید": ['سر', 'دا', 'دی'],
  "سردادند": ['سر', 'دا', 'دن'],

  "شبی": ['ش', 'بی'],
  "شراب": ['ش', 'را'],
  "شرابم": ['ش', 'را', 'ب'],
  "شرابت": ['ش', 'را', 'ب'],
  "شرابش": ['ش', 'را', 'ب'],
  "شرابمان": ['ش', 'را', 'ب', 'ما'],
  "شرابتان": ['ش', 'را', 'ب', 'تا'],
  "شرابشان": ['ش', 'را', 'ب', 'شا'],

  
  "زندگی": ['زن', 'د', 'گی'],
  "زندگیم": ['زن', 'د', 'گی', 'ی'],
  "زندگیت": ['زن', 'د', 'گی', 'ی'],
  "زندگیش": ['زن', 'د', 'گی', 'ی'],
  
  "زدم": ['ز', 'دم'],
  "زدی": ['ز', 'دی'],
  "زده": ['ز', 'د'],
  "زدیم": ['ز', 'دی'],
  "زدید": ['ز', 'دی'],
  "زدند": ['ز', 'دن'],

  "زبان": ['ز', 'با'],
  "زبانم": ['ز', 'با', 'ن'],
  "زبانت": ['ز', 'با', 'ن'],
  "زبانمان": ['ز', 'با', 'ن', 'ما'],
  "زمین": ['ز', 'می'],
  "همین": ['ه', 'می'],
  "رنگین": ['رن', 'گی', 'ی'],
  
  "ربودمان":['ر', 'بو', 'د', 'ما'],
  "روانمان": ['ر', 'وا', 'ن', 'ما'],
  "روانتان": ['ر', 'وا', 'ن', 'تا'],
  "روانشان": ['ر', 'وا', 'ن', 'شا'],

  "روزگار": ['رو', 'ز', 'گا'],
  "روزگاری": ['رو', 'ز', 'گا', 'ری'],
  "روزگارم": ['رو', 'ز', 'گا', 'ر'],
  "روزگارت": ['رو', 'ز', 'گا', 'ر'],
  "روزگارش": ['رو', 'ز', 'گا', 'ر'],
  "روزگارمان": ['رو', 'ز', 'گا', 'ر', 'ما'],
  "روزگارتان": ['رو', 'ز', 'گا', 'ر', 'تا'],
  "روزگارشان": ['رو', 'ز', 'گا', 'ر', 'شا'],
  "راضی": ['را', 'ضی'],
  "خلق": ['خل'],
  "خوشبختی": ['خو', 'ش', 'بخ', 'تی'],
  "دوستیابی": ['دو', 'س', 'یا', 'بی'],
  "درد": ['در'],
  "دردم": ['در', 'دم'],
  "دردت": ['در', 'دت'],
  "دردش": ['در', 'دش'],
  "دردمان": ['در', 'د', 'ما'],
  "دردتان": ['در', 'د', 'تا'],
  "دردشان": ['در', 'د', 'شا'],

  "دفع": ['د', 'فع'],
  "دفترم": ['دف', 'ت', 'ر'],
  "دفترت": ['دف', 'ت', 'ر'],
  "دفترش": ['دف', 'ت', 'ر'],
  "دفترمان": ['دف', 'ت', 'ر', 'ما'],
  "دفترتان": ['دف', 'ت', 'ر', 'تا'],
  "دفترشان": ['دف', 'ت', 'ر', 'شا'],
}
let wordList = {
  ...acceptWordList, 
  
  "دیار": ['دی', 'یا', 'ر'],
  "دریا": ['در', 'یا'],
  "دوست": ['دس', 'ت'],
  "دوستی": ['دس', 'تی'],
  "دیارم": ['دی', 'یا', 'رم'],
  "دیارت": ['دی', 'یا', 'رت'],
  "دلان": ['د', 'لا'],
  "دری": ['د', 'ری'],
  "دلم": ["د", 'لم'],
  "دلت": ["د", 'لت'],
  "دلش": ["د", 'لش'],
  
  // "دلمان": ["د", 'ل', 'ما'],
  // "دلتان": ["د", 'ل', 'تا'],
  // "دلشان": ["د", 'ل', 'شا'],
  
  "دویدن": ['د', 'وی', 'دن'],
  "دویدم": ['د', 'وی', 'دم'],
  "دویدی": ['د', 'وی', 'دی'],
  "دوید": ['د', 'وی', 'د'],
  
  "دویدیم": ['د', 'وی', 'دی', 'م'],
  "دویدید": ['د', 'وی', 'دی', 'د'],
  "دویدند": ['د', 'وی', 'دن', 'د'],

  "دهیم": ['د', 'هی', 'م'],
  "دهید": ['د', 'هی', 'د'],
  "دهند": ['د', 'هن', 'د'],

  "ذکر": ['ذک', 'ر'],

  "ردیف": ['ر', 'دی', 'ف'],
  "رفیق": ['ر', 'فی' , 'ق'],

  "سوی": ['سو', 'ی'],

  "لیوان": ['لی', 'وا', 'ن'],
  "لیوانم": ['لی', 'وا', 'نم'],
  "لیوانت": ['لی', 'وا', 'نت'],
  "لیوانش": ['لی', 'وا', 'نش'],
  "لیوانمان": ['لی', 'وا', 'نم', 'ما', 'ن'],
  "لیوانتان": ['لی', 'وا', 'نت', 'تا', 'ن'],
  "لیوانشان": ['لی', 'وا', 'نش', 'شا', 'ن'],

  "خیال": ['خی', 'یا', 'ل'],
  
  "علیم": ['ع', 'لی', 'م'],
  "حکیم": ['ح', 'کی', 'م'],
  "رحیم": ['ر', 'حی', 'م'],
  "شریف": ['ش', 'ری', 'ف'],
  "سلیس": ['س', 'لی', 'س'],

  "فرق": ['فر', 'ق'],
  "فریاد": ['فر', 'یا', 'د'],
  "فریادم": ['فر', 'یا', 'دم'],
  "فریادت": ['فر', 'یا', 'دت'],
  "فریادش": ['فر', 'یا', 'دش'],
  "فریادمان": ['فر', 'یا', 'د', 'ما', 'ن'],
  "فریادتان": ['فر', 'یا', 'د', 'تا', 'ن'],
  
  "قند": ['قن', 'د'],

  "قلب": ['قل', 'ب'],
  "قلبم": ['قل', 'بم'],
  "قلبت": ['قل', 'بت'],
  "قلبش": ['قل', 'بش'],
  "قلبمان": ['قل', 'ب', 'ما', 'ن'],
  "قلبتان": ['قل', 'ب', 'تا', 'ن'],
  "قلبشان": ['قل', 'ب', 'شا', 'ن'],

  "قهوه": ['قه', 'وه'],

  "قلتو": ['قل', 'تو'],
  "غمگین": ['غم', 'گی', 'ن'],
  "غمگینم": ['غم', 'گی', 'نم'],
  "غمگینی": ['غم', 'گی', 'نی'],
  "غمگینه": ['غم', 'گی', 'نه'],
  "غمگینیم": ['غم', 'گی', 'نی', 'م'],
  "غمگینید": ['غم', 'گی', 'نی', 'د'],
  "غمگینند": ['غم', 'گی', 'نن', 'د'],

  "علم": ['عل', 'م'],
  "عشق": ['عش', 'ق'],
  "عشقم": ['عش', 'قم'],
  "عشقت": ['عش', 'قت'],
  "عشقش": ['عش', 'قش'],
  "عاشقان": ['عا', 'ش', 'قا', 'ن'],
  "عروسک": ['ع', 'رو', 'سک'],
  "عروسکم": ['ع', 'رو', 'س', 'کم'],
  "عروسکت": ['ع', 'رو', 'س', 'کت'],
  "عروسکش": ['ع', 'رو', 'س', 'کش'],
  
  "عجیب": ['ع', 'جی', 'ب'],
  "طبیعت": ['ط', 'بی', 'عت'],

  

  "کلمه": ['ک', 'لم', 'م'],
  "کلمات": ['ک', 'لم', 'ما', 'ت'],
  "کنایه": ['ک', 'نا', 'ی'],

  "کمر": ['ک', 'مر'],
  "کمرم": ['ک', 'مر', 'رم'],
  "کمرت": ['ک', 'مر', 'رت'],
  "کمرش": ['ک', 'مر', 'رش'],
  "کمرمان": ['ک', 'رم', 'ر', 'ما'],
  "کمرتان": ['ک', 'رم', 'ر', 'تا'],
  "کمرشان": ['ک', 'رم', 'ر', 'شا'],
  "کیک": ['کی', 'ک'],
  "کیکم": ['کی', 'کم'],
  "کیکت": ['کی', 'کت'],
  "کیکش": ['کی', 'کش'],
  "کیکمان": ['کی', 'ک', 'ما'],
  "کیکتان": ['کی', 'ک', 'تا'],
  "کیکشان": ['کی', 'ک', 'شا'],

  "کردم": ['کر', 'دم'],
  "کردی": ['کر', 'دی'],
  "کرد": ['کر', 'د'],
  "کرده": ['کر', 'د'],
  "کردیم": ['کر', 'دی', 'م'],
  "کردید": ['کر', 'دی', 'د'],
  "کردند": ['کر', 'دن', 'د'],
  "کبوتر": ['ک', 'بو', 'تر'],


  "گریستن": ['گ', 'ری', 'س', 'تن'],
  "گلچین": ['گل', 'چی', 'ن'],
  "گلچینم": ['گل', 'چی', 'نم'],
  "گلچینت": ['گل', 'چی', 'نت'],
  "گلچینش": ['گل', 'چی', 'نش'],
  "گلچینمان": ['گل', 'چی', 'نم', 'ما'],
  "گلچینتان": ['گل', 'چی', 'نت', 'تا'],
  "گلچینشان": ['گل', 'چی', 'نش', 'شا'],

  "گفت": ['گف', 'ت'],

  "گویم": ['گو', 'یم'],
  "گویی": ['گو', 'یی'],
  "گوید": ['گو', 'ید'],
  "گوییم": ['گو', 'یی', 'م'],
  
  "گویند": ['گو', 'ین', 'د'],

  "هستم": ['هس', 'تم'],
  "هستی": ['هس', 'تی'],
  "هست": ['هس', 'ت'],
  "هستیم": ['هس', 'تی', "م"],
  
  "هستند": ['هس', 'تن', "د"],

  "نباش": ['ن', 'با', 'ش'],
  "نشان": ['ن', 'شا'],
  "نشانم": ['ن', 'شا', 'نم'],
  "نشانت": ['ن', 'شا', 'نت'],
  "نشانش": ['ن', 'شا', 'نش'],

  "نمانم": ['ن', 'ما', 'نم'],
  "نمانی": ['ن', 'ما', 'نی'],
  "نماند": ['ن', 'ما', 'ند'],
  "نمانیم": ['ن', 'ما', 'نی', 'م'],
  "نمانید": ['ن', 'ما', 'نی', 'د'],
  "نمانند": ['ن', 'ما', 'نن', 'د'],

  "نوشته": ['ن', 'وش', 'ته'],
  "نوشتن":['ن', 'وش', 'تن'],
  "نوشتم":['ن', 'وش', 'تم'],
  "نوشتی": ['ن', 'وش', 'تی'],
  "نوشت": ['ن', 'وش', 'ت'],
  "نوشتیم": ['ن', 'وش', 'تی', "م"],
  "نوشتید": ['ن', 'وش', 'تی', "د"],
  "نوشتند": ['ن', 'وش', 'تن', "د"],
  
  "نویسم": ['ن', 'وی', 'سم'],
  "نویسی": ['ن', 'وی', 'سی'],
  "نویسد": ['ن', 'وی', 'سد'],
  "نویسیم": ['ن', 'وی', 'سی', 'م'],
  "نویسید": ['ن', 'وی', 'سی', 'د'],
  "نویسند": ['ن', 'وی', 'سن', 'د'],

  "نماند": ['ن', 'ما', 'ند'],
  "نبند": ['ن', 'بن', 'د'],

  "حسادت": ['ح','سا', 'دت'],
  "حسادتم": ['ح','سا', 'د', 'تم'],
  "حسادتت": ['ح','سا', 'د', 'تت'],
  "حسادتش": ['ح','سا', 'د', 'تش'],
  "حسادمان": ['ح','سا', 'د', 'ت', 'ما'],
  "حسادتان": ['ح','سا', 'د', 'ت', 'تا'],
  "حسادشان": ['ح','سا', 'د', 'ت', 'شا'],

  "چخوف": ['چ', 'خو', 'ف'],
  "طعنه": ['طع', 'نه'],
  "وقتی": ['وق', 'تی'],

  "ملکا": ['م', 'ل', 'کا'],
  "میگفتم": ['می', 'گف', 'تم'],
  "میگفتی": ['می', 'گف', 'تی'],
  "میگفت": ['می', 'گف', 'ت'],
  "میگفتیم": ['می', 'گف', 'تی', 'م'],
  "میگفتید": ['می', 'گف', 'تی', 'د'],
  "میگفتند": ['می', 'گف', 'تن', 'د'],
  "میزنم": ['می', 'ز', 'نم'],
  "میزنی": ['می', 'ز', 'نی'],
  "میزند": ['می', 'ز', 'ند'],
  "میزنیم": ['می', 'ز', 'نی', 'م'],
  "میزنید": ['می', 'ز', 'نی', 'د'],
  "میزنند": ['می', 'ز', 'نن', 'د'],
  
  "میرسد": ['می', 'ر', 'سد'],
  
  "محرم": ["مح", 'رم'],
  "محرمه": ["مح", 'ر', 'مه'],
  "مستطیل": ['مس', 'ت', 'طی', 'ل'],
  "مستطیلم": ['مس', 'ت', 'طی', 'لم'],
  "مستطیلت": ['مس', 'ت', 'طی', 'لت'],
  "مستطیلش": ['مس', 'ت', 'طی', 'لش'],
  "مستطیلمان": ['مس', 'ت', 'طی', 'ل', 'ما'],
  "مستطیلتان": ['مس', 'ت', 'طی', 'ل', 'تا'],
  "مستطیلشان": ['مس', 'ت', 'طی', 'ل', 'شا'],

  "نگفتم": ['ن', 'گف', 'تم'],
  "نمی": ['ن', 'می'],
  "نغمه": ['نغ', 'مه'],
  "نهنگ": ['ن', 'هن', 'گ'],
  "نهنگم": ['ن', 'هن', 'گم'],
  "نهنگت": ['ن', 'هن', 'گت'],
  "نهنگش": ['ن', 'هن', 'گش'],
  "نهنگمان": ['ن', 'هن', 'گم', 'ما'],
  "نهنگتان": ['ن', 'هن', 'گت', 'تا'],
  "نهنگشان": ['ن', 'هن', 'گش', 'شا'],
  
  "نگاه": ['ن', 'گا', 'ه'],
  "نگاهم": ['ن', 'گا', 'هم'],
  "نگاهت": ['ن', 'گا', 'هت'],
  "نگاهش": ['ن', 'گا', 'هش'],

  "نمیدهم": ['ن', 'می', 'د', 'هم'],
  "نمیدهی": ['ن', 'می', 'د', 'هی'],
  "نمیدهد": ['ن', 'می', 'د', 'هد'],
  "نمیدهیم": ['ن', 'می', 'د', 'هی', 'م'],
  "نمیدهید": ['ن', 'می', 'د', 'هی', 'د'],
  "نمیدهند": ['ن', 'می', 'د', 'هن', 'د'],
  
  "وزن": ['وز', 'ن'],
  "وسوسه": ['وس', 'و', 'سه'],

  "مفتخر": ['مف', 'تخ', 'خر'],
  "مردم": ['مر', 'دم'],
  "مرداس": ['مر', 'دا', 'س'],
  "مرد": ['مر', 'د'],
  "میوه": ['می', 'وه'],
  
  "مرغ": ['مر', 'غ'],
  "مرغم": ['مر', 'غم'],
  "مرغت": ['مر', 'غت'],
  "مرغش": ['مر', 'غش'],
  "مرغمان": ['مر', 'غ', 'ما'],
  "مرغتان": ['مر', 'غ', 'تا'],
  "مرغشان": ['مر', 'غ', 'شا'],

  "میخوانمش": ['می', 'خا', 'نم', 'مش'],
  "مسیری": ['م', 'سی', 'ری'],
  "مبارکست": ['م', 'با', 'رک', 'کس', 'ت'],
  "منیژه": ['م', 'نی', 'ژه'],
  "مهتاب": ['ب', 'تا', 'ب'],
  "معتاد": ['مع', 'تا', 'د'],
  "میام": ['می', 'یا', 'م'],
  "میای": ['می', 'یا', 'ی'],
  "میاد": ['می', 'یا', 'د'],
  "میایم": ['می', 'یا', 'یم'],
  "میاین": ['می', 'یا', 'ین'],
  "میان": ['می', 'یا'],
  "مثل": ['مث', 'ل'],

  "یاد": ['یا', 'د'],
  "یادگار": ['یا', 'د', 'گا', 'ر'],
  "یادگاری": ['یا', 'د', 'گا', 'ری'],
  "یار": ['یا', 'ر'],
  "یکی": ['ی', 'کی'],
  "یاس": ['یا', 'س'],
  "یاسم": ['یا', 'سم'],
  "یاسی": ['یا', 'سی'],
  "یوز": ['یو', 'ز'],
  "یوزم": ['یو', 'زم'],
  "یوزی": ['یو', 'زی'],

  "ویران": ['وی', 'را', 'ن'],
  "ویرانم": ['وی', 'را', 'نم'],
  "ویرانی": ['وی', 'را', 'نی'],
  "ویرانیم": ['وی', 'را', 'نی', 'م'],
  "ویرانید": ['وی', 'را', 'نی', 'د'],
  "ویرانند": ['وی', 'را', 'نن', 'د'],
  "همیشه": ['ه', 'می', 'شه'],
  "آنتوان": ["ءا", "ن", "ت", "وا", "ن"],
  "بامدادی": ['با', 'م', 'دا', 'دی'],
  
  "باید": ['با', 'ید'],
  "بیشتر": ['بی', 'ش', 'تر'],
  "بیشترم": ['بی', 'ش', 'ت', 'رم'],
  "بیشترش": ['بی', 'ش', 'ت', 'رش'],
  "برتره": ['بر', 'ت', 'ر'],
  "پیشرفت": ['پی', 'ش', 'رف', 'ت'],
  "پارس": ['پا', 'ر', 'س'],
  "صفتاش": ['ص', 'ف', 'تا', 'ش'],
  "ببین": ['ب', 'بی', 'ن'],
}

// wordList = [];

const dbSyllables = {
  'یک': '-',
  'دو': '-',
  'سه': '-',
  // ا
  'اب': '-',
  'اپ': '-',
  'اث': '-',
  'اج': '-',
  'اح': '-',
  'اخ': '-',
  'اد': '-',
  'اذ': '-',
  'ار': '-',
  'از': '-',
  'اژ': '-',
  'اس': '-',
  'اش': '-',
  'اص': '-',
  'اض': '-',
  'اط': '-',
  'اظ': '-',
  'اع': '-',
  'اغ': '-',
  'اف': '-',
  'اق': '-',
  'اک': '-',
  'ال': '-',
  'ام': '-',
  'ان': '-',
  'او': '-',
  'اه': '-',
  'ای': '-',
  // ب
  'با': '-',
  'بب': '-',
  'بپ': '-',
  'بت': '-',
  'بج': '-',
  'بچ': '-',
  'بح': '-',
  'بخ': '-',
  'بد': '-',
  'بذ': '-',
  'بر': '-',
  'بز': '-',
  'بژ': '-',
  'بس': '-',
  'بش': '-',
  'بص': '-',
  'بض': '-',
  'بط': '-',
  'بع': '-',
  'بغ': '-',
  'بف': '-',
  'بک': '-',
  'بگ': '-',
  'بل': '-',
  'بم': '-',
  'بن': '-',
  'بو': '-',
  'بی': '-',
  'به': '-',
  // پ
  'پا': '-',
  'پپ': '-',
  'پت': '-',
  'پچ': '-',
  'پخ': '-',
  'پد': '-',
  'پذ': '-',
  'پر': '-',
  'پز': '-',
  'پژ': '-',
  'پس': '-',
  'پش': '-',
  'پغ': '-',
  'پف': '-',
  'پک': '-',
  'پگ': '-',
  'پل': '-',
  'پم': '-',
  'پن': '-',
  'پو': '-',
  'په': '-',
  'پی': '-',
  // ت
  'تا': '-',
  'تب': '-',
  'تپ': '-',
  'تت': '-',
  'ته': '-',
  'تح': '-',
  'تخ': '-',
  'تج': '-',
  'تف': '-',
  'تس': '-',
  'تش': '-',
  'تل': '-',
  'تم': '-',
  'تک': '-',
  'تگ': '-',
  'تن': '-',
  'تر': '-',
  'تز': '-',
  'تو': '-',
  'تص': '-',
  'تد': '-',
  'تی': '-',
  // ث
  'ثا': '-',
  'ثب': '-',
  'ثت': '-',
  'ثخ': '-',
  'ثن': '-',
  // ج
  'جا': '-',
  'جب': '-',
  'جت': '-',
  'جج': '-',
  'جخ': '-',
  'جر': '-',
  'جز': '-',
  'جس': '-',
  'جش': '-',
  'جل': '-',
  'جم': '-',
  'جن': '-',
  'جو': '-',
  'جی': '-',
  // چ
  'چا': '-',
  'چب': '-',
  'چت': '-',
  'چخ': '-',
  'چر': '-',
  'چس': '-',
  'چش': '-',
  'چل': '-',
  'چم': '-',
  'چن': '-',
  'چو': '-',
  'چی': '-',
  'جه': '-',
  // ح
  'حا': '-',
  'حب': '-',
  'حت': '-',
  'حج': '-',
  'حر': '-',
  'حس': '-',
  'حش': '-',
  'حل': '-',
  'حم': '-',
  'حن': '-',
  'حو': '-',
  'حی': '-',
  // خ
  'خا': '-',
  'خج': '-',
  'خد': '-',
  'خر': '-',
  'خش': '-',
  'خط': '-',
  'خل': '-',
  'خم': '-',
  'خن': '-',
  'خو': '-',
  'خس': '-',
  'خی': '-',
  // د
  'دا': '-',
  'دب': '-',
  'دت': '-',
  'دج': '-',
  'در': '-',
  'دس': '-',
  'دش': '-',
  'دل': '-',
  'دم': '-',
  'دن': '-',
  'دو': '-',
  'دی': '-',
  // ذ
  'ذو': '-',
  'ذی': '-',
  // ر
  'را': '-',
  'رب': '-',
  'رپ': '-',
  'رت': '-',
  'رج': '-',
  'رح': '-',
  'رخ': '-',
  'رد': '-',
  'رذ': '-',
  'رر': '-',
  'رز': '-',
  'رژ': '-',
  'رس': '-',
  'رش': '-',
  'رع': '-',
  'رغ': '-',
  'رف': '-',
  'رک': '-',
  'رگ': '-',
  'رل': '-',
  'رم': '-',
  'رو': '-',
  'ری': '-',
  // ز
  'زا': '-',
  'زب': '-',
  'زت': '-',
  'زج': '-',
  'زر': '-',
  'زس': '-',
  'زش': '-',
  'زل': '-',
  'زم': '-',
  'زن': '-',
  'زو': '-',
  'زی': '-',
  // ژ
  'ژا': '-',
  'ژب': '-',
  'ژت': '-',
  'ژر': '-',
  'ژس': '-',
  // س
  'سا': '-',
  'سب': '-',
  'ست': '-',
  'سج': '-',
  'سر': '-',
  'سز': '-',
  'سش': '-',
  'سل': '-',
  'سم': '-',
  'سن': '-',
  'سو': '-',
  'سه': '-',
  'سی': '-',
  // ش
  'شا': '-',
  'شب': '-',
  'شت': '-',
  'شج': '-',
  'شر': '-',
  'شس': '-',
  'شع': '-',
  'شل': '-',
  'شم': '-',
  'شن': '-',
  'شو': '-',
  'شی': '-',
  // ص
  'صا': '-',
  'صب': '-',
  'صت': '-',
  'صن': '-',
  'صو': '-',
  'صی': '-',
  // ض
  'ضا': '-',
  'ضب': '-',
  'دت': '-',
  'ضر': '-',
  'دس': '-',
  'دش': '-',
  // ط
  'طا': '-',
  'طب': '-',
  'تت': '-',
  'طر': '-',
  'تس': '-',
  // ظ
  'ظا': '-',
  'ظب': '-',
  'ظت': '-',
  'ظن': '-',
  'ظم': '-',
  // ع
  'عا': '-',
  'عب': '-',
  'عت': '-',
  'عج': '-',
  'عر': '-',
  'عز': '-',
  'عس': '-',
  'عش': '-',
  'عل': '-',
  'عم': '-',
  'عن': '-',
  'عو': '-',
  'عی': '-',
  // غ
  'غا': '-',
  'غب': '-',
  'غت': '-',
  'غر': '-',
  'غس': '-',
  'غم': '-',
  'غش': '-',
  // ف
  'فا': '-',
  'فب': '-',
  'فت': '-',
  'فج': '-',
  'فر': '-',
  'فز': '-',
  'فس': '-',
  'فش': '-',
  'فل': '-',
  'فم': '-',
  'فن': '-',
  'فو': '-',
  'فی': '-',
  // ق
  'قا': '-',
  'قب': '-',
  'قت': '-',
  'قج': '-',
  'قر': '-',
  'قز': '-',
  'قس': '-',
  'قش': '-',
  'قل': '-',
  'قم': '-',
  'قن': '-',
  'قو': '-',
  'قی': '-',
  // ک
  'کا': '-',
  'کب': '-',
  'کت': '-',
  'کج': '-',
  'کر': '-',
  'کز': '-',
  'کس': '-',
  'کش': '-',
  'کل': '-',
  'کم': '-',
  'کن': '-',
  'کو': '-',
  'کی': '-',
  // گ
  'گا': '-',
  'گب': '-',
  'گت': '-',
  'گج': '-',
  'گر': '-',
  'گس': '-',
  'گش': '-',
  'گل': '-',
  'گم': '-',
  'گن': '-',
  'گو': '-',
  'گی': '-',
  // ل
  'لا': '-',
  'لب': '-',
  'لت': '-',
  'لج': '-',
  'لر': '-',
  'لز': '-',
  'لس': '-',
  'لش': '-',
  'لک': '-',
  'لم': '-',
  'لن': '-',
  'لو': '-',
  'لی': '-',
  // م
  'ما': '-',
  'مب': '-',
  'مت': '-',
  'مج': '-',
  'مح': '-',
  'مخ': '-',
  'مر': '-',
  'مز': '-',
  'مس': '-',
  'مش': '-',
  'مل': '-',
  'مم': '-',
  'من': '-',
  'مو': '-',
  'می': '-',
  // ن
  'نا': '-',
  'نب': '-',
  'نت': '-',
  'نج': '-',
  'نر': '-',
  'نز': '-',
  'نس': '-',
  'نش': '-',
  'نل': '-',
  'نم': '-',
  'نن': '-',
  'نو': '-',
  'نی': '-',
  'نه': '-',
  // ه
  'ها': '-',
  'هب': '-',
  'هت': '-',
  'هج': '-',
  'هر': '-',
  'هز': '-',
  'هس': '-',
  'هش': '-',
  'هل': '-',
  'هم': '-',
  'هن': '-',
  'هو': '-',
  'هی': '-',
};


// این حروف میتوانند هم نشانه صامت باشند و هم مصوت.
function isSmallVowels(char) {
  return char === 'و' || char === 'ا' || char === 'ه' || char === 'ی'; // اضافه کردن شرایط خاص
}

// function isBigVowels()
// {
//   return char === 'گ' || char === 'ث'; // اضافه کردن شرایط خاص
// }

function isMidelVowels(char) {
  return char === 'ل' || char === 'ر' || char === 'ز'; // اضافه کردن شرایط خاص
}

function extractSyllablesV(words, syllables, i)
{
  let lastWord = '';
  let lastChar = '';
  if(i>0)
  {
    lastWord = words[i-1];
    lastChar = lastWord.slice(lastWord.length - 1);
  }
  const lastSyllableIndex = syllables.length -1;
  let lastSyllable = syllables[lastSyllableIndex];
  if(lastSyllable != null)
  {
    // console.log(lastSyllable.slice(lastSyllable.length -1));
    if(lastSyllable.slice(lastSyllable.length -1) != lastChar)
    {
      return [`${lastChar}و`];
    }
    else
    {
      if(lastSyllable.length == 1)
      {
        syllables[lastSyllableIndex] = lastSyllable + 'و';
        return [];
      }
      else
      {
        return [lastChar + 'و'];
      }
    }
    
    // else
    // {
    //   const lastCharIndex = lastSyllable.length - 1;
    //   return [lastSyllable.charAt(lastCharIndex) + 'و']
    // }
    return 'و';
  }
  else
  {
    return 'و';
  }
}

function extractSyllablesAndLettersFromWord(word, syllables) {
  const result = [];
  let i = 0;
  while (i < word.length) {
    const twoChars = word.slice(i, i + 2);
    const firstChar = word.slice(i, i + 1);
    const secChar = word.slice(i+1, i + 2);
    const thirdChar = word.slice(i+2, i + 3);
    // console.log(twoChars, i);
    if (word.length - i == 1 && firstChar == 'ن' && syllables[-1] == 'با') {
      break; // پایان حلقه
    }
    if (word.length - i < 3) {
      // console.log(word.slice(i, word.length));
      result.push(word.slice(i)); // اضافه کردن کاراکتر باقی‌مانده
      break; // پایان حلقه
    }

    if(twoChars == 'ءا') { result.push('ءا'); i+= 2; continue;}
    if(word.length == 3 && isSmallVowels(secChar)) { result.push(`${firstChar}${secChar}`); i+= 2; continue; }
    if(isSmallVowels(firstChar) && isSmallVowels(secChar)) { result.push(`${firstChar}${secChar}`); i+= 2; continue; }
    if(isSmallVowels(secChar) && isSmallVowels(thirdChar)) {
      result.push(firstChar);
      result.push(`${secChar}${thirdChar}`);
      i+= 3;
      continue;
    }
    
    if (dbSyllables[twoChars] != null) {
      result.push(twoChars);
      i += 2; // دو کاراکتر را گذر می‌کنیم
    } else {
      result.push(word.charAt(i)); // اضافه کردن یک کاراکتر به نتیجه
      i += 1; // یک کاراکتر را گذر می‌کنیم
    }
  }
  return result;
}

function checkComma(words, i)
{
  if(i == 0) { return false }
  const lastWord = words[i-1];
  const currWord = words[i];
  const endCharLastWord = lastWord[lastWord.length - 1];
  if(endCharLastWord == '،' && currWord.length == 1 )
  {
    return [currWord];
  }
  else
  {
    return false;
  }
}

function filterWordChar(str)
{
  let newWord = str.replaceAll('خوا', 'خا');
  newWord = newWord.replaceAll('آ', 'ءا');
  return newWord;
}

function filterWordSpecialChar(str)
{
  let newWord = str.replaceAll('+', '');
  newWord = newWord.replaceAll('،', '');
  return newWord;
}

function extractSyllablesAndLettersFromText(text) {
  const cleanedText = text.replace(/[.'"\]\[؟?,\/#!$%\^&\*;:{}=\-_`~()]/g, '').replace(/\s+/g, ' ').trim();
  const words = cleanedText.split(' ');
  const allResults = [];

  words.forEach((word, i) => {
    // این قسمت برای اینه که اگر خواستیم و یک هجای جداگانه حساب بشه با کاما جدا میکنیمش
    const comma = checkComma(words, i);
    let syllablesAndLetters = [];
    let newWord = filterWordSpecialChar(filterWordChar(word));
    if(comma != false)
    {
      if(wordList[filterWordSpecialChar(word)] != null)
      {
        syllablesAndLetters = wordList[filterWordSpecialChar(word)];
      }
      else
      {
        syllablesAndLetters = comma;
      }
      
    }
    else if(newWord == 'و')
    {
      syllablesAndLetters = extractSyllablesV(words, allResults, i);
      allResults.push(...syllablesAndLetters);
      return;
    }
    else
    {
      // if(newWord.length < 3)
      // {
      //   syllablesAndLetters = extractSyllablesAndLettersFromSmallWord(newWord);
      // }
      // else
      // {
        // console.log(wordList[newWord], newWord);
        if(wordList[filterWordSpecialChar(word)] != null)
        {
          syllablesAndLetters = wordList[filterWordSpecialChar(word)];
        }
        else
        {
          syllablesAndLetters = extractSyllablesAndLettersFromWord(newWord, allResults);
          // console.log(syllablesAndLetters);
        }
      // }
    }
    allResults.push(...syllablesAndLetters); // اضافه کردن به آرایه کلی
  });

  return allResults;
}
